[
    {
        "title": "Transportation and mobility",
        "slug": "transportation-and-mobility",
        "description": "Nokia Crowd movement destination visualiser for city planners. Summary. This one is meant for city planners who can optimise routes , traffic signalling and other infrastructure by seeing crowd movement on a map. I did the UX and concept design work here, trying to work out what to do with the anonymous data that cellular towers see. This app is meant to be used on iPads and allow quick interaction while walking on the streets. The functionality & my role Cellular networks are used as the data source here by polling them to pinpoint where anonymous dots on the map start their journey and where they end up. I did the stakeholder interviews, desk research, concept design and wires. The joy of hex. Using hexagons and a restrictred, but modern colour palette we created a contemporary look and feel to the Destination Count module. When the hexagons are slightly apart, it gives each small area in the map a distinct feel that separates it from it’s neighbours and subtly gives the user the hint that this is something to interact with. The hexagon as a shape is both iconic and familiar, boasting a sense of direction in more than four ways and it’s use in games denotes interactivity. The clock. Using a simple clock we can limit the data shown on the to a specific time, in this example the wee hours after midnight. A tap on any hexagon reveals the exact or approximate number that travelled from location. The wireframes. Entire project was based on engineer interviews and I had very little time to prove the validity of user interactions. We wanted to keep all interactions very simple and show the map as large as possible for the planners to make their decisions without distractions. Intel Social navigation and calendar mash-up for Tizen Summary & my role. I did a bunch of explorative projects for Intel, where we tried to find new ways of interacting with computers and phones. These were all concepts that were realised but never released to the public. Intel was about to launch Tizen OS to the world and wanted the built-in apps to have a different flair to them. I worked closely with Intel’s R&D team to create this mash-up of contacts, messages, calendar and navigation in a single app. We did some initial research with users to determine what sort of functionality they would like to see if we could merge navigation with their contacts. The biggest and most obvious user group here were people who might work in sales where they have to meet people through out the day in various locations. Points-of-interests on the map correspond to the functionality of the app. Your appointments, the people you know and share their location as well as your known places are shown on the map. The app calculates your optimal routes and tells you how much time you can spend at each location, if you have multiple events planned for the day. Tapping on the POIs will open a radial menu around it with correspnding actions. If the user taps on ‘Me’ then all the actions that are for you will pop-up.",
        "short_description": "Nokia Crowd movement destination visualiser for city planners. Summary. This one is meant for city planners who can optimise routes , traffic signalling and other infrastructure by seeing crowd...",
        "content_html": "<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Nokia</h1><h2>Crowd movement destination visualiser for city planners.</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This one is meant for city planners who can optimise routes , traffic signalling and other infrastructure by seeing crowd movement on a map. </p><p class=\"\"><br/>I did the UX and concept design work here, trying to work out what to do with the anonymous data that cellular towers see.</p><p class=\"\"><br/>This app is meant to be used on iPads and allow quick interaction while walking on the streets.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/Map+dark+1.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The functionality &amp; my role </h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Cellular networks are used as the data source here by polling them to pinpoint where anonymous dots on the map start their journey and where they end up.</p><p class=\"\">I did the stakeholder interviews, desk research, concept design and wires.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The joy of hex.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Using hexagons and a restrictred, but modern colour palette we created a contemporary look and feel to the Destination Count module. </p><p class=\"\"><br/>When the hexagons are slightly apart, it gives each small area in the map a distinct feel that separates it from it’s neighbours and subtly gives the user the hint that this is something to interact with. </p><p class=\"\"><br/>The hexagon as a shape is both iconic and familiar, boasting a sense of direction in more than four ways and it’s use in games denotes interactivity.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/Frame+6.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The clock.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Using a simple clock we can limit the data shown on the to a specific time, in this example the wee hours after midnight. </p><p class=\"\"><br/>A tap on any hexagon reveals the exact or approximate number that travelled from location.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/nok2+1.webp\" alt=\"transportation-and-mobility image\"></div><div class=\"project-media\"><img src=\"assets/transportation-and-mobility/nokiaDV_heat1-01+1.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The wireframes.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Entire project was based on engineer interviews and I had very little time to prove the validity of user interactions. We wanted to keep all interactions very simple and show the map as large as possible for the planners to make their decisions without distractions.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Intel</h1><h2>Social navigation and calendar mash-up for Tizen</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary &amp; my role.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I did a bunch of explorative projects for Intel, where we tried to find new ways of interacting with computers and phones. </p><p class=\"\">These were all concepts that were realised but never released to the public.</p><p class=\"\"><br/>Intel was about to launch Tizen OS to the world and wanted the built-in apps to have a different flair to them. </p><p class=\"\"><br/>I worked closely with Intel’s R&amp;D team to create this mash-up of contacts, messages, calendar and navigation in a single app.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/Frame+16.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">We did some initial research with users to determine what sort of functionality they would like to see if we could merge navigation with their contacts.</p><p class=\"\"><br/>The biggest and most obvious user group here were people who might work in sales where they have to meet people through out the day in various locations.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/smartee1+1_004.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Points-of-interests on the map correspond to the functionality of the app. Your appointments, the people you know and share their location as well as your known places are shown on the map.</p><p class=\"\"><br/>The app calculates your optimal routes and tells you how much time you can spend at each location, if you have multiple events planned for the day.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/smartee2+1.webp\" alt=\"transportation-and-mobility image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Tapping on the POIs will open a radial menu around it with correspnding actions.</p><p class=\"\"><br/>If the user taps on ‘Me’ then all the actions that are for you will pop-up.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40.webp\" alt=\"transportation-and-mobility image\"></div>",
        "images": [
            "assets/transportation-and-mobility/Frame+16.webp",
            "assets/transportation-and-mobility/Frame+16_002.webp",
            "assets/transportation-and-mobility/Frame+16_003.webp",
            "assets/transportation-and-mobility/Frame+16_004.webp",
            "assets/transportation-and-mobility/Frame+16_005.webp",
            "assets/transportation-and-mobility/Frame+16_006.webp",
            "assets/transportation-and-mobility/Frame+16_007.webp",
            "assets/transportation-and-mobility/Frame+16_008.webp",
            "assets/transportation-and-mobility/Frame+6.webp",
            "assets/transportation-and-mobility/Frame+6_002.webp",
            "assets/transportation-and-mobility/Frame+6_003.webp",
            "assets/transportation-and-mobility/Frame+6_004.webp",
            "assets/transportation-and-mobility/Frame+6_005.webp",
            "assets/transportation-and-mobility/Frame+6_006.webp",
            "assets/transportation-and-mobility/Frame+6_007.webp",
            "assets/transportation-and-mobility/Frame+6_008.webp",
            "assets/transportation-and-mobility/Frame+8.webp",
            "assets/transportation-and-mobility/Map+dark+1.webp",
            "assets/transportation-and-mobility/Map+dark+1_002.webp",
            "assets/transportation-and-mobility/Map+dark+1_003.webp",
            "assets/transportation-and-mobility/Map+dark+1_004.webp",
            "assets/transportation-and-mobility/Map+dark+1_005.webp",
            "assets/transportation-and-mobility/Map+dark+1_006.webp",
            "assets/transportation-and-mobility/Map+dark+1_007.webp",
            "assets/transportation-and-mobility/Map+dark+1_008.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40_002.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40_003.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40_004.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40_005.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40_006.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40_007.webp",
            "assets/transportation-and-mobility/Screenshot+2021-06-12+at+10.34.40_008.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox_002.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox_003.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox_004.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox_005.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox_006.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox_007.webp",
            "assets/transportation-and-mobility/Screenshot_20210604-225255_Firefox_008.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox_002.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox_003.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox_004.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox_005.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox_006.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox_007.webp",
            "assets/transportation-and-mobility/Screenshot_20210605-010213_Firefox_008.webp",
            "assets/transportation-and-mobility/nok2+1.webp",
            "assets/transportation-and-mobility/nok2+1_002.webp",
            "assets/transportation-and-mobility/nok2+1_003.webp",
            "assets/transportation-and-mobility/nok2+1_004.webp",
            "assets/transportation-and-mobility/nok2+1_005.webp",
            "assets/transportation-and-mobility/nok2+1_006.webp",
            "assets/transportation-and-mobility/nok2+1_007.webp",
            "assets/transportation-and-mobility/nok2+1_008.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1_002.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1_003.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1_004.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1_005.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1_006.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1_007.webp",
            "assets/transportation-and-mobility/nokiaDV_heat1-01+1_008.webp",
            "assets/transportation-and-mobility/smartee1+1.webp",
            "assets/transportation-and-mobility/smartee1+1_002.webp",
            "assets/transportation-and-mobility/smartee1+1_003.webp",
            "assets/transportation-and-mobility/smartee1+1_004.webp",
            "assets/transportation-and-mobility/smartee1+1_005.webp",
            "assets/transportation-and-mobility/smartee1+1_006.webp",
            "assets/transportation-and-mobility/smartee1+1_007.webp",
            "assets/transportation-and-mobility/smartee1+1_008.webp",
            "assets/transportation-and-mobility/smartee2+1.webp",
            "assets/transportation-and-mobility/smartee2+1_002.webp",
            "assets/transportation-and-mobility/smartee2+1_003.webp",
            "assets/transportation-and-mobility/smartee2+1_004.webp",
            "assets/transportation-and-mobility/smartee2+1_005.webp",
            "assets/transportation-and-mobility/smartee2+1_006.webp",
            "assets/transportation-and-mobility/smartee2+1_007.webp",
            "assets/transportation-and-mobility/smartee2+1_008.webp"
        ],
        "thumbnail": "assets/transportation-and-mobility/Frame+16.webp",
        "original_file": "Transportation and mobility — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Viking Line",
        "slug": "viking-line",
        "description": "Viking Line Digital Cruise experience We won the iF award for service design with the design. Honored! Summary. This is a digital strategy project for one of the largest cruise line companies in the Nordics. To illustrate the use cases of the app I created a video for internal use, which was so well received that Viking Line requested me to do this video with professional actors. This shows most of the use cases while on board. It is used by Viking Line in their marketing material as well. Several rounds of user research sessions were held to create the first version of the digital experience. The second version took what we envisioned the first version to be like minus the features that we got either negative feedback from or the analytics showed little or no interaction. The team & my role. Duration: 12 months Team: 3 User researchers, 3 Service Designers, 2 User Experience Designers , 1 Design Strategist, 1 Visual Designer, 3 Developers, a sales guy. I did the user experience design and parts of the strategy scoping. A year and a half later I created a second version of the app with another UX designer, a visual designer and the same group of developers. The problem. Essentially the problem with sea travel is the lack of WiFi, or cellular reception. Satellite uplinks are of course available and that's how the on-board WiFi on airplanes work as well. But whereas an airplane is a hollow tube made of paper-thin aluminium, carrying a few hundred people, the modern cruiseliner is a one, giant behemoth of interconnected Faraday cages. There is no signal strong enough to permeate it's walls or to cater to it's thousands of passengers. Browsing the web on the seven seas is no smooth sailing. It's more like the browsing experience the year Prince had his big shindig. So, when we took on the task to bring digital services on board Viking's fleet, we basically made an intranet for passengers. Let's think about it for a second: WhatsApp doesn't work, Safari barely hangs in there, no Tinder, no Instagram, tweets become croaks and it's just no fun at all. We needed to make the online world live on the boat without access to the services people are used to. This of course was remedied for the second version as better uplinks are becoming cheaper and more readily available. Thousands of ideas. Before we started on the design process, we, together with Viking Line, held an internal competition for the ship staff to come with ideas how a mobile application could make their work easier and serve the passengers better. The app needs to both ways, help the staff and serve the passengers. This Excel sheet is the bank of ideas we collected. Contextual interviews were conducted on location right there, without additional luring or recruiting. Using the Excel sheet created from the internal contest, we discussed with Viking Line to identify the key touchpoints where we want the users' input. Based on the focus group sessions, the contest document and stakeholder workshop, we created this small video and the accompanying UI mock-up to show the user journey. This image illustrates the user journey of the various touchpoints that we could enhance with a digital layer. In order to make the app work, we needed to create a map of what works on-board, what works when the user has a trip booked and trip is approaching and what works when the user doesn't have a trip booked. The infographic above shows what touchpoints on the app are dependent on whether the phone is connected to the ship's internal network. For example, you can't use the social functions like chatting with fellow passengers if you are still ashore. This flow diagram shows what happens in the app when the user is ashore. Not only are some of the features of the app locked away while ashore, the actual main home screen is made adaptive to the location and time. Due to alcohol, tobacco and gambling laws, it isn't possible to show all the content ashore, but sail away and you can smoke and drink and gamble yourself to death, if so desired. We mapped out what are the important things to show to the passenger at each step of the way togther with the motivation to do so. This is the current application's IA. A lot of compromises were made to accommodate all the functions. The new application has a much more complex architecture, but a radically simplified UI. I designed the new app according to analytics, dropping the entire menu, which people hardly touched, with a five-button tab bar. The added functionality of the 2.0 version makes the app much better and functional.",
        "short_description": "Viking Line Digital Cruise experience We won the iF award for service design with the design. Honored! Summary. This is a digital strategy project for one of the largest cruise line companies in...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Viking Line</h1><h2>Digital Cruise experience</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<blockquote><p class=\"\">We won the <a href=\"https://ifworlddesignguide.com/entry/177937-digital-cruise-experience\" target=\"_blank\">iF award for service design</a> with the design. Honored!</p></blockquote>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/ifawa_006.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This is a digital strategy project for one of the largest cruise line companies in the Nordics.</p><p class=\"\">To illustrate the use cases of the app I created a video for internal use, which was so well received that Viking Line requested me to do this video with professional actors. </p><p class=\"\">This shows most of the use cases while on board. It is used by Viking Line in their marketing material as well.</p><p class=\"\">Several rounds of user research sessions were held to create the first version of the digital experience.</p><p class=\"\">The second version took what we envisioned the first version to be like minus the features that we got either negative feedback from or the analytics showed little or no interaction. </p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The team &amp; my role.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Duration: 12 months</p><p class=\"\">Team: 3 User researchers, <strong>3 Service Designers, 2 User Experience Designers</strong>, 1 Design Strategist, 1 Visual Designer, 3 Developers, a sales guy.</p><p class=\"\">I did the user experience design and parts of the strategy scoping.  </p><p class=\"\">A year and a half later I created a second version of the app with another UX designer, a visual designer and the same group of developers.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The problem.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Essentially the problem with sea travel is the lack of WiFi, or cellular reception.</p><p class=\"\">Satellite uplinks are of course available and that's how the on-board WiFi on airplanes work as well. </p><p class=\"\">But whereas an airplane is a hollow tube made of paper-thin aluminium, carrying a few hundred people, the modern cruiseliner is a one, giant behemoth of interconnected Faraday cages. There is no signal strong enough to permeate it's walls or to cater to it's thousands of passengers. </p><p class=\"\">Browsing the web on the seven seas is no smooth sailing. It's more like the browsing experience the year Prince had his big shindig.</p><p class=\"\">So, when we took on the task to bring digital services on board Viking's fleet, we basically made an intranet for passengers. </p><p class=\"\">Let's think about it for a second: WhatsApp doesn't work, Safari barely hangs in there, no Tinder, no Instagram, tweets become croaks and it's just no fun at all. </p><p class=\"\">We needed to make the online world live on the boat without access to the services people are used to.</p><p class=\"\">This of course was remedied for the second version as better uplinks are becoming cheaper and more readily available.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/Untitled-1-01_007.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Thousands of ideas.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Before we started on the design process, we, together with Viking Line, held an internal competition for the ship staff to come with ideas how a mobile application could make their work easier and serve the passengers better.</p><p class=\"\">The app needs to both ways, help the staff and serve the passengers.</p><p class=\"\">This Excel sheet is the bank of ideas we collected.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/excel.webp\" alt=\"viking-line image\"></div><div class=\"project-media\"><img src=\"assets/viking-line-mdash/khfjhf.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Contextual interviews were conducted on location right there, without additional luring or recruiting. </p><p class=\"\">Using the Excel sheet created from the internal contest, we discussed with Viking Line to identify the key touchpoints where we want the users' input. </p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Based on the focus group sessions, the contest document and stakeholder workshop, we created this small video and the accompanying UI mock-up to show the user journey.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/strat-02_003.webp\" alt=\"viking-line image\"></div><div class=\"project-media\"><img src=\"assets/viking-line-mdash/vi_jour.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This image illustrates the user journey of the various touchpoints that we could enhance with a digital layer.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/jhf.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">In order to make the app work, we needed to create a map of what works on-board, what works when the user has a trip booked and trip is approaching and what works when the user doesn't have a trip booked. </p><p class=\"\">The infographic above shows what touchpoints on the app are dependent on whether the phone is connected to the ship's internal network. </p><p class=\"\">For example, you can't use the social functions like chatting with fellow passengers if you are still ashore.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/excel_008.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This flow diagram shows what happens in the app when the user is ashore.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/homescr.webp\" alt=\"viking-line image\"></div><div class=\"project-media\"><img src=\"assets/viking-line-mdash/ux-03_003.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Not only are some of the features of the app locked away while ashore, the actual main home screen is made adaptive to the location and time. </p><p class=\"\">Due to alcohol, tobacco and gambling laws, it isn't possible to show all the content ashore, but sail away and you can smoke and drink and gamble yourself to death, if so desired. </p><p class=\"\">We mapped out what are the important things to show to the passenger at each step of the way togther with the motivation to do so.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/infoarch.webp\" alt=\"viking-line image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This is the current application's IA. A lot of compromises were made to accommodate all the functions. </p><p class=\"\">The new application has a much more complex architecture, but a radically simplified UI. </p><p class=\"\">I designed the new app according to analytics, dropping the entire menu, which people hardly touched, with a five-button tab bar. </p><p class=\"\">The added functionality of the 2.0 version makes the app much better and functional.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/viking-line-mdash/analytic-04_007.webp\" alt=\"viking-line image\"></div>",
        "images": [
            "assets/viking-line-mdash/Frame+8.webp",
            "assets/viking-line-mdash/Untitled-1-01.webp",
            "assets/viking-line-mdash/Untitled-1-01_002.webp",
            "assets/viking-line-mdash/Untitled-1-01_003.webp",
            "assets/viking-line-mdash/Untitled-1-01_004.webp",
            "assets/viking-line-mdash/Untitled-1-01_005.webp",
            "assets/viking-line-mdash/Untitled-1-01_006.webp",
            "assets/viking-line-mdash/Untitled-1-01_007.webp",
            "assets/viking-line-mdash/Untitled-1-01_008.webp",
            "assets/viking-line-mdash/analytic-04.webp",
            "assets/viking-line-mdash/analytic-04_002.webp",
            "assets/viking-line-mdash/analytic-04_003.webp",
            "assets/viking-line-mdash/analytic-04_004.webp",
            "assets/viking-line-mdash/analytic-04_005.webp",
            "assets/viking-line-mdash/analytic-04_006.webp",
            "assets/viking-line-mdash/analytic-04_007.webp",
            "assets/viking-line-mdash/analytic-04_008.webp",
            "assets/viking-line-mdash/excel.webp",
            "assets/viking-line-mdash/excel_002.webp",
            "assets/viking-line-mdash/excel_003.webp",
            "assets/viking-line-mdash/excel_004.webp",
            "assets/viking-line-mdash/excel_005.webp",
            "assets/viking-line-mdash/excel_006.webp",
            "assets/viking-line-mdash/excel_007.webp",
            "assets/viking-line-mdash/excel_008.webp",
            "assets/viking-line-mdash/homescr.webp",
            "assets/viking-line-mdash/homescr_002.webp",
            "assets/viking-line-mdash/homescr_003.webp",
            "assets/viking-line-mdash/homescr_004.webp",
            "assets/viking-line-mdash/homescr_005.webp",
            "assets/viking-line-mdash/homescr_006.webp",
            "assets/viking-line-mdash/homescr_007.webp",
            "assets/viking-line-mdash/homescr_008.webp",
            "assets/viking-line-mdash/ifawa.webp",
            "assets/viking-line-mdash/ifawa_002.webp",
            "assets/viking-line-mdash/ifawa_003.webp",
            "assets/viking-line-mdash/ifawa_004.webp",
            "assets/viking-line-mdash/ifawa_005.webp",
            "assets/viking-line-mdash/ifawa_006.webp",
            "assets/viking-line-mdash/ifawa_007.webp",
            "assets/viking-line-mdash/ifawa_008.webp",
            "assets/viking-line-mdash/image-asset.webp",
            "assets/viking-line-mdash/image-asset_002.webp",
            "assets/viking-line-mdash/image-asset_003.webp",
            "assets/viking-line-mdash/image-asset_004.webp",
            "assets/viking-line-mdash/image-asset_005.webp",
            "assets/viking-line-mdash/image-asset_006.webp",
            "assets/viking-line-mdash/image-asset_007.webp",
            "assets/viking-line-mdash/image-asset_008.webp",
            "assets/viking-line-mdash/infoarch.webp",
            "assets/viking-line-mdash/infoarch_002.webp",
            "assets/viking-line-mdash/infoarch_003.webp",
            "assets/viking-line-mdash/infoarch_004.webp",
            "assets/viking-line-mdash/infoarch_005.webp",
            "assets/viking-line-mdash/infoarch_006.webp",
            "assets/viking-line-mdash/infoarch_007.webp",
            "assets/viking-line-mdash/infoarch_008.webp",
            "assets/viking-line-mdash/jhf.webp",
            "assets/viking-line-mdash/jhf_002.webp",
            "assets/viking-line-mdash/jhf_003.webp",
            "assets/viking-line-mdash/jhf_004.webp",
            "assets/viking-line-mdash/jhf_005.webp",
            "assets/viking-line-mdash/jhf_006.webp",
            "assets/viking-line-mdash/jhf_007.webp",
            "assets/viking-line-mdash/jhf_008.webp",
            "assets/viking-line-mdash/khfjhf.webp",
            "assets/viking-line-mdash/khfjhf_002.webp",
            "assets/viking-line-mdash/khfjhf_003.webp",
            "assets/viking-line-mdash/khfjhf_004.webp",
            "assets/viking-line-mdash/khfjhf_005.webp",
            "assets/viking-line-mdash/khfjhf_006.webp",
            "assets/viking-line-mdash/khfjhf_007.webp",
            "assets/viking-line-mdash/khfjhf_008.webp",
            "assets/viking-line-mdash/strat-02.webp",
            "assets/viking-line-mdash/strat-02_002.webp",
            "assets/viking-line-mdash/strat-02_003.webp",
            "assets/viking-line-mdash/strat-02_004.webp",
            "assets/viking-line-mdash/strat-02_005.webp",
            "assets/viking-line-mdash/strat-02_006.webp",
            "assets/viking-line-mdash/strat-02_007.webp",
            "assets/viking-line-mdash/strat-02_008.webp",
            "assets/viking-line-mdash/ux-03.webp",
            "assets/viking-line-mdash/ux-03_002.webp",
            "assets/viking-line-mdash/ux-03_003.webp",
            "assets/viking-line-mdash/ux-03_004.webp",
            "assets/viking-line-mdash/ux-03_005.webp",
            "assets/viking-line-mdash/ux-03_006.webp",
            "assets/viking-line-mdash/ux-03_007.webp",
            "assets/viking-line-mdash/ux-03_008.webp",
            "assets/viking-line-mdash/vi_jour.webp",
            "assets/viking-line-mdash/vi_jour_002.webp",
            "assets/viking-line-mdash/vi_jour_003.webp",
            "assets/viking-line-mdash/vi_jour_004.webp",
            "assets/viking-line-mdash/vi_jour_005.webp",
            "assets/viking-line-mdash/vi_jour_006.webp",
            "assets/viking-line-mdash/vi_jour_007.webp",
            "assets/viking-line-mdash/vi_jour_008.webp"
        ],
        "thumbnail": "assets/viking-line-mdash/Frame+8.webp",
        "original_file": "Viking Line — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "F-Secure Sense router design",
        "slug": "f-secure-sense",
        "description": "F-secure SENSE - industrial design for a router I was a part of a team of two creating the industrial design for this router. This was shipped and for sale for a limited time. Techradar called it ‘stylish’ making me proud ;) Read their review here. Summary. Initially we wanted to do a simple prism shape (above) that could stand vertically or lay down horizontally neatly in a bookshelf, but we had to go back to the drawing board due to the manufacturer not being able provide the device enough ventilation to stay cool and silent. So we shrank the prism, duplicated it and pasted both together giving us the final, distinct lozenge shape that had proper ventilation and fit the PCB nicely and securily (below). This is the final retail version. The design & the problem. We ran series of focus group sessions between each iteration. The first sessions were ran using crude napkin sketches, the second with higher fidelity sketches and the following ones with 3d renders and the last one with 3d printed mock-ups. A few of the focus groups were ran with female-only participants, as we wanted this to be router that has universal look to it as possible and hearing from our first few sessions that all the current routers look as if they were made for men only. Here are some sketches and renders of the most outlandish ones from those sessions. Testing and iterating.",
        "short_description": "F-secure SENSE - industrial design for a router I was a part of a team of two creating the industrial design for this router. This was shipped and for sale for a limited time. Techradar called it...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\"> </p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>F-secure</h1><h2>SENSE - industrial design for a router</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I was a part of a team of two creating the industrial design for this router.</p><p class=\"\"><br/>This was shipped and for sale for a limited time. Techradar called it ‘stylish’ making me proud ;) <a href=\"https://www.techradar.com/uk/reviews/f-secure-sense-router\">Read their review here.</a></p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/sense-mdash/sens8+1.webp\" alt=\"f-secure-sense image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Initially we wanted to do a simple prism shape (above) that could stand vertically or lay down horizontally neatly in a bookshelf, but we had to go back to the drawing board due to the manufacturer not being able provide the device enough ventilation to stay cool and silent. </p><p class=\"\"><br/>So we shrank the prism, duplicated it and pasted both together giving us the final, distinct lozenge shape that had proper ventilation and fit the PCB nicely and securily (below). </p><p class=\"\">This is the final retail version.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The design &amp; the problem.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/sense-mdash/sense+1.webp\" alt=\"f-secure-sense image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">We ran series of focus group sessions between each iteration. The first sessions were ran using crude napkin sketches, the second with higher fidelity sketches and the following ones with 3d renders and the last one with 3d printed mock-ups.</p><p class=\"\">A few of the focus groups were ran with female-only participants, as we wanted this to be router that has universal look to it as possible and hearing from our first few sessions that all the current routers look as if they were made for men only.</p><p class=\"\">Here are some sketches and renders of the most outlandish ones from those sessions.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Testing and iterating.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/sense-mdash/Group+52.webp\" alt=\"f-secure-sense image\"></div>",
        "images": [
            "assets/sense-mdash/Frame+8.webp",
            "assets/sense-mdash/Group+52.webp",
            "assets/sense-mdash/Group+52_002.webp",
            "assets/sense-mdash/Group+52_003.webp",
            "assets/sense-mdash/Group+52_004.webp",
            "assets/sense-mdash/Group+52_005.webp",
            "assets/sense-mdash/Group+52_006.webp",
            "assets/sense-mdash/Group+52_007.webp",
            "assets/sense-mdash/Group+52_008.webp",
            "assets/sense-mdash/sens8+1.webp",
            "assets/sense-mdash/sens8+1_002.webp",
            "assets/sense-mdash/sens8+1_003.webp",
            "assets/sense-mdash/sens8+1_004.webp",
            "assets/sense-mdash/sens8+1_005.webp",
            "assets/sense-mdash/sens8+1_006.webp",
            "assets/sense-mdash/sens8+1_007.webp",
            "assets/sense-mdash/sens8+1_008.webp",
            "assets/sense-mdash/sense+1.webp",
            "assets/sense-mdash/sense+1_002.webp",
            "assets/sense-mdash/sense+1_003.webp",
            "assets/sense-mdash/sense+1_004.webp",
            "assets/sense-mdash/sense+1_005.webp",
            "assets/sense-mdash/sense+1_006.webp",
            "assets/sense-mdash/sense+1_007.webp",
            "assets/sense-mdash/sense+1_008.webp"
        ],
        "thumbnail": "assets/sense-mdash/Frame+8.webp",
        "original_file": "Sense — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Traffic Safety Centre North",
        "slug": "traffic-safety",
        "description": "Traffic safety centre north Dynamic materials for increased traffic safety Summary I ran an EU funded design research project inspecting how to use smart materials to increase traffic safety. I created a material library and plenty of concepts with a final prototype to be used by rescue personnel when practising extracting car crash victims. Brief To find out if smart or dynamic new materials could be used to enhance traffic safety in any way not thought previously possible or could made better. To get contacts with industry leaders and establish relationships with them. To make workshops with design students, surgeons, physiotherapists, smart material specialists, rescue personnel and design students. Project - Academic research for EU funded Traffic Safety Center North - One year long project run by the University hospital of Umeå - Stakeholders were mostly experts on spine injuries - Individual and group work. Leading and creating workshops. - Directing visual designers Martin Ruszkowski and Mikael Lugnegård to visualise the concepts created in those workshops Tool created for getting mass user input As we did the project we wanted to get the public's opinion on what matters in traffic safety for them. Doing a web survey would have been an option, but would have required a lot of work to get people to participate in it. We devised a much simpler way to get these opinions via Twitter. Using the city of Umeå's main square we put up a wall where people would either write or draw their idea. The pens used were eBeam interactive whiteboard markers and with some clever hack I managed to get the images in to Twitter to appear as inline images. This way we only needed to read the images from the Twitter account and analyse them. Process & concepts The images you see in this page are created by visual designers Martin Ruszkowski and Mikael Lugnegård under my direction. These concepts were created from the results of several workshops that we had with various disciplines. First of all to get ourselves acquainted with what happens to the human body in traffic accidents, we held a workshop with surgeons and physiotherapists. The second workshop was held together with the fire brigade on-site when they (and us) were practicing how to cut open a car and getting the patient out safely. Third and fourth workshops were held with ambulance staff and we were mostly figuring out how transport the patient more safely using new materials. The fifth workshop was held together with Midé Technologies and design school students where we started find out what to do with the materials, how they work and how we could use them in and out of vehicle traffic safety. I created a prototype out of all the things we learned. This small robotic part simulates spinal fractures in practice dummies. This part is replicating the approximate size and normal movement of the C2-C3 vertebrae , which are the most critical ones when extracting the patient. I managed to create a 6 DOF simulated fracture when so needed and get the values out, if the fracture was moved in anyway. This is important knowledge for ambulance personnel to get when practicing, so they know how to transport the patient without moving the spine at all. We did have all the values needed from the medical research we gathered and managed to alert every time spine moved too much if at all",
        "short_description": "Traffic safety centre north Dynamic materials for increased traffic safety Summary I ran an EU funded design research project inspecting how to use smart materials to increase traffic safety. I...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Traffic safety centre north</h1><h2>Dynamic materials for increased traffic safety</h2>\n</div>\n<div class=\"project-media\"><img src=\"assets/traffic-safety-centre-north-mdash/image-asset_004.webp\" alt=\"traffic-safety image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I ran an EU funded design research project inspecting how to use smart materials to increase traffic safety. </p><p class=\"\">I created a material library and plenty of concepts with a final prototype to be used by rescue personnel when practising extracting car crash victims.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Brief</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">To find out if smart or dynamic new materials could be used to enhance traffic safety in any way not thought previously possible or could made better. </p><p class=\"\">To get contacts with industry leaders and establish relationships with them. </p><p class=\"\">To make workshops with design students, surgeons, physiotherapists, smart material specialists, rescue personnel and design students. </p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Project</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">- Academic research for EU funded Traffic Safety Center North<br/>- One year long project run by the University hospital of Umeå<br/>- Stakeholders were mostly experts on spine injuries<br/>- Individual and group work. Leading and creating workshops.<br/>- Directing visual designers Martin Ruszkowski and Mikael Lugnegård to visualise the concepts created in those workshops</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Tool created for getting mass user input</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">As we did the project we wanted to get the public's opinion on what matters in traffic safety for them. Doing a web survey would have been an option, but would have required a lot of work to get people to participate in it. </p><p class=\"\">We devised a much simpler way to get these opinions via Twitter. Using the city of Umeå's main square we put up a wall where people would either write or draw their idea. </p><p class=\"\">The pens used were eBeam interactive whiteboard markers and with some clever hack I managed to get the images in to Twitter to appear as inline images. </p><p class=\"\">This way we only needed to read the images from the Twitter account and analyse them.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Process &amp; concepts</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">The images you see in this page are created by visual designers Martin Ruszkowski and Mikael Lugnegård under my direction. These concepts were created from the results of several workshops that we had with various disciplines. </p><p class=\"\">First of all to get ourselves acquainted with what happens to the human body in traffic accidents, we held a workshop with surgeons and physiotherapists. </p><p class=\"\">The second workshop was held together with the fire brigade on-site when they (and us) were practicing how to cut open a car and getting the patient out safely. </p>\n</div>\n<div class=\"project-media\"><img src=\"assets/traffic-safety-centre-north-mdash/image-asset_031.webp\" alt=\"traffic-safety image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Third and fourth workshops were held with ambulance staff and we were mostly figuring out how transport the patient more safely using new materials. </p><p class=\"\">The fifth workshop was held together with Midé Technologies and design school students where we started find out what to do with the materials, how they work and how we could use them in and out of vehicle traffic safety. </p>\n</div>\n<div class=\"project-media\"><img src=\"assets/traffic-safety-centre-north-mdash/ssq.webp\" alt=\"traffic-safety image\"></div><div class=\"project-media\"><img src=\"assets/traffic-safety-centre-north-mdash/ssq_008.webp\" alt=\"traffic-safety image\"></div><div class=\"project-media\"><img src=\"assets/traffic-safety-centre-north-mdash/ssq_007.webp\" alt=\"traffic-safety image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I created a prototype out of all the things we learned. This small robotic part simulates spinal fractures in practice dummies. </p><p class=\"\">This part is replicating the approximate size and normal movement of the <a href=\"https://en.wikipedia.org/wiki/Cervical_vertebrae\" target=\"_blank\">C2-C3 vertebrae</a>, which are the most critical ones when extracting the patient. </p><p class=\"\">I managed to create a <a href=\"https://en.wikipedia.org/wiki/Six_degrees_of_freedom\">6 DOF</a> simulated fracture when so needed and get the values out, if the fracture was moved in anyway. </p><p class=\"\">This is important knowledge for ambulance personnel to get when practicing, so they know how to transport the patient without moving the spine at all. We did have all the values needed from the medical research we gathered and managed to alert every time spine moved too much if at all </p>\n</div>\n",
        "images": [
            "assets/traffic-safety-centre-north-mdash/Frame+8.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_002.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_003.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_004.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_005.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_006.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_007.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_008.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_009.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_010.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_011.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_012.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_013.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_014.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_015.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_016.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_017.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_018.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_019.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_020.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_021.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_022.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_023.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_024.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_025.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_026.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_027.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_028.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_029.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_030.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_031.webp",
            "assets/traffic-safety-centre-north-mdash/image-asset_032.webp",
            "assets/traffic-safety-centre-north-mdash/ssq.webp",
            "assets/traffic-safety-centre-north-mdash/ssq_002.webp",
            "assets/traffic-safety-centre-north-mdash/ssq_003.webp",
            "assets/traffic-safety-centre-north-mdash/ssq_004.webp",
            "assets/traffic-safety-centre-north-mdash/ssq_005.webp",
            "assets/traffic-safety-centre-north-mdash/ssq_006.webp",
            "assets/traffic-safety-centre-north-mdash/ssq_007.webp",
            "assets/traffic-safety-centre-north-mdash/ssq_008.webp"
        ],
        "thumbnail": "assets/traffic-safety-centre-north-mdash/Frame+8.webp",
        "original_file": "Traffic Safety Centre North — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "General Mobile phone design",
        "slug": "general-mobile-phone-design",
        "description": "General Mobile Cryptographic secure satellite phone Summary. This thicc boi was designed so that it hides it’s chunky innards and stamp-sized screen to a somewhat modern design. I did the concept and industrial design here in a team of two. Rendering was handled by our 3D specialists. Fool me once… As this is a satelite phone, it’s a bit under 4 cm or an inch and a half thick due to the electronics and battery size.  We decided to fool the eye and hide chunkiness by tapering edges substantially. The screen of the device is tiny, so to again fool the eye, the top of the device is designed completely black to hide the shortcomings of the tech. The waistband houses the crypto call button that encrypts the calls. This phone has a very niche market and is geared for diplomats and other government personnel who need outmost privacy for their calls. Inspiration. I was heavily inspired by Naoto Fukusawa’s classic designs for the iida Infobar line of phones. One of which I am a proud owner of. Interactions. Trying to figure out where to put the crypto call button in 2D. We decided to put in the middle and as big as possible, because probably no one will probably use this for normal calls and rather carry a second phone for the not-so-secret calls. Final design. We created two colourways for both of the diplomats who got this phone ;)",
        "short_description": "General Mobile Cryptographic secure satellite phone Summary. This thicc boi was designed so that it hides it’s chunky innards and stamp-sized screen to a somewhat modern design. I did the concept...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\"> </p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>General Mobile</h1><h2>Cryptographic secure satellite phone</h2>\n</div>\n<div class=\"project-media\"><img src=\"assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1.webp\" alt=\"general-mobile-phone-design image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This thicc boi was designed so that it hides it’s chunky innards and stamp-sized screen to a somewhat modern design.</p><p class=\"\">I did the concept and industrial design here in a team of two. <br/>Rendering was handled by our 3D specialists.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Fool me once…</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_005.webp\" alt=\"general-mobile-phone-design image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">As this is a satelite phone, it’s a bit under 4 cm or an inch and a half thick due to the electronics and battery size.  We decided to fool the eye and hide chunkiness by tapering edges substantially.</p><p class=\"\"><br/>The screen of the device is tiny, so to again fool the eye, the top of the device is designed completely black to hide the shortcomings of the tech. </p><p class=\"\"><br/>The waistband houses the crypto call button that encrypts the calls. </p><p class=\"\"><br/>This phone has a very niche market and is geared for diplomats and other government personnel who need outmost privacy for their calls.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Inspiration.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1.webp\" alt=\"general-mobile-phone-design image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I was heavily inspired by Naoto Fukusawa’s classic designs for the iida Infobar line of phones. One of which I am a proud owner of.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Interactions.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2.webp\" alt=\"general-mobile-phone-design image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Trying to figure out where to put the crypto call button in 2D. We decided to put in the middle and as big as possible, because probably no one will probably use this for normal calls and rather carry a second phone for the not-so-secret calls.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Final design.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2.webp\" alt=\"general-mobile-phone-design image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">We created two colourways for both of the diplomats who got this phone ;)</p>\n</div>\n",
        "images": [
            "assets/general-mobile-mdash/Frame+8.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1_002.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1_003.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1_004.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1_005.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1_006.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1_007.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+1_008.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2_002.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2_003.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2_004.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2_005.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2_006.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2_007.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.40+2_008.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_002.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_003.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_004.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_005.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_006.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_007.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+1_008.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2_002.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2_003.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2_004.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2_005.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2_006.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2_007.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.41+2_008.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1_002.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1_003.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1_004.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1_005.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1_006.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1_007.webp",
            "assets/general-mobile-mdash/Screenshot+2021-03-30+at+21.52+1_008.webp"
        ],
        "thumbnail": "assets/general-mobile-mdash/Frame+8.webp",
        "original_file": "General mobile — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Smaller Projects",
        "slug": "smaller-projects",
        "description": "Small things Tiny but cool Al Jazeera - News app proposal TL;DR I created a proposal for a complete revision of Al Jazeera's mobile offering. Unfortunately we didn't win, but managed to utilise some elements in the AJ+ project. I devised a navigation model that doesn't use tabs or or back navigation at all, this allows quick navigation between article list, article detail, article actions and application menu views. This model seems suitable for mobiles as the interaction time when using an app is extremely short compared to, for example, this website. As attention span is short it's more important to see quickly the headlines, read the article and get back to the headlines again. Oh, remember those nice panoramic images from previous project I did for Al Jazeera? Well, they made their way in to this proposal as well, except here half of the image is used as the headline \"thumbnail\" and the other half as the header image on the article itself MORE CLEVER THINGS So, news are reported by journalists, but sometimes the readers don't have clue why somethings are happening in the world. Now in the days of Quora and Reddit, where users come together and communicate and explain things, it seems logical that the source of the news should allow the same. We imagined a similar type of service for Al Jazeera, where a user can discuss or contribute to an article. This isn't, however, an ordinary comments thread, but more like Quora, where readers can ask questions about the article and other users or the author of the article can answer to that. We do this by the following way: \"Superusers\" are users who contribute much to the content. These users have privileges over ordinary users as they can answer questions in the Q&A sections and moderate contributions. They can also be asked by Al Jazeera to contribute content if, for example, they are in a location where a breaking news story is occurring. \"Contributions\" are content created by the users. The contributions are multimedia in nature, meaning that they can be text, photos, videos or audio clips. Each contribution can be voted up or down by other users. The ratio between ups and downs determines the contribution's position in the list. The position of the user's posting adds up to her superuser score. \"Q&A\" are questions related to the article posted by the users. This is because a lot of news have a background that is not obvious to all readers/viewers. An example question could be for example related to an article about South Sudan; “What is the reason for South Sudans recent independence?” Superusers and Al Jazeera correspondents and editors can answer these questions. These answers can also be voted up and down and add up to the Superuser score. Outotec - Particle size analyser TL;DR I designed an interface for a stand-alone machine, that analyses particle sizes in mines from the slurry created in the mining process. This is an Electron app. Role I took care of the UX on my own and instructed both the visual designer and front-end developer to carry out my designs. There was an earlier interface running on a special version of Windows CE, that I studied carefully in order to understand how the interface should be built. My task was to re-design everything in the software to better suit a resistive touch screen input and make views and navigation much clearer. I took care of UX matters in direct communication with the client. I instructed the client on future UX creation, as this was the first new type of interface that will be implemented across the product catalogue in future versions, while moving away from old Windows CE systems. The Machine The machine needs to be explained in order to understand any of this. Rock is mined, then the rock is grinded down until it's basically mud water or slurry. Reagents are added to the slurry and minerals are extracted chemically from it. For the mine to be efficient, the particles (the grinded-down rock) need to be of constant size. If they are not, then there is a problem in the grinding process somewhere. The analyser has three different lines coming in from three different grinders. The machine lets in slurry from lines one at a time and lets it flow through it. In the middle of the machine there is a ceramic \"hammer and anvil\" that trap particles between them and measures the size of the particle twice per second. This done for two minutes, after which the machine is flushed with clear water. The machine then checks that the \"hammer and anvil\" meet at value zero. Then the next line opens and and the process is repeated. It's about the size of Michael Jordan and features an embedded touchscreen. What's going on here? So much stuff! True, but for a reason. Let me explain This interface needs to glanceable, since the user research showed that users in the mines don't need go so often deeper in the interface than the first screen, where they are presented with all the necessary information. On the top of the screen is the main navigation arranged in tabs and then two buttons. The other is obviously info screen, but what's the other? Well, as this interface is installed on to a machine that sits in the part of the mine where the minerals are extracted, the environment is dirty to the extreme. Hence, the screen needs to be constantly wiped clean, but as it as a resistive touchscreen, (durable, can be operated with gloves on) the screen needs to be turned off to do the cleaning. So, that button turns off the touch functions and displays a counter from ten to zero, when the user can wipe the screen. Each tab has under it a group of sub-tabs, shown later. The other tabs and their sub-tabs are rarely accessed and are mostly detailed views or the settings of the main screens. On the left of the are all the assay assigned to lines and here it's where it gets complicated. See, the machine can measure different things like the acidity or alkalinity of the water in pH or particle size in micrometres or meshes or the slurry density. But assays can be heavily customised to catch any deviations that might occur. So the assays are custom in nature, that's why we gave them no predefined names, rather when the user defines the assays, she also names them. On the right from top down we have first the machine state as text and then line control buttons. Let's check those later. Then we have the machine operation animation. We are essentially looking at the profile of the machine on the top the light grey rectangle is the slurry inlet. You can see brown water flowing through it when the slurry is coming in. The various sensors are also marked on the diagram. the \"hammer and anvil\" is the last thing before the pH sensor. It will blink twice a second when measuring.' The sequence clock Image taken from the wireframes explain the lower right half of the main view. This the actual operation of the machine explained in an infographic. Let's see the customisation part to understand this better. Configuring the sequence clock The sequence clock was designed closely together with Outotec's engineers to get it right. All the switches in the UI are either on/off buttons or in this case three stage buttons. Here, they cycle through the lines. Multiple assays can be taken from the same line, which is most of the times a line is repeated in the sequence several times. It could be also that some lines simply don't produce as much as others. Again, this had to be designed as heavily customisable simplicity. Intel Screensavings - Windows boot UI Hoo-boy. This sure is a weird one. Intel can put stuff on computers before Windows boots up. They basically own that few seconds before ol' Bill's OS kicks in. So they asked us to make some kind of UI that would have sponsored content in order to lower the purchasing cost of the computer as well some very small user defined content. And it needed to be in 3D. And you needed to see the previous offers that were there the last time you booted up the computer. And it needed to act like an interactive screensaver if the computer had been idle for a while, hence the name. So... we came up with this one. I did the UX and animation here. Direct quote from focus group testing: \"It's like Ironman!\" Very strange concept, I must say. Maybe all things designed are not meant to be. Service design concept for stadiums So we did a concept for a digital platform for stadiums and other venues. I was part of the team designing the service, which I then made in to this nifty little animation. Some of the graphics we bought, some I did. Service concept for a digital real estate company This is a whitelabeled concept of a digital real estate company. I did the concept, script and animation directly with our lead designer and art director, not even bothering with the wireframes. This concept was used by an un-named company for their internal purposes. \"Well, that was some experience. Now just let me adjust the spatial controls and we'll move to another observation point.\" -Forrest J. Ackerman",
        "short_description": "Small things Tiny but cool Al Jazeera - News app proposal TL;DR I created a proposal for a complete revision of Al Jazeera's mobile offering. Unfortunately we didn't win, but managed to utilise...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Small things</h1><h2>Tiny but cool</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Al Jazeera - News app proposal</h3><p class=\"\"><strong>TL;DR</strong></p><p class=\"\">I created a proposal for a complete revision of Al Jazeera's mobile offering. Unfortunately we didn't win, but managed to utilise some elements in the AJ+ project.</p>\n</div>\n<div class=\"project-video\"><iframe src=\"https://www.youtube.com/embed/aKW5F9uKcbc?\nautoplay=1&controls=0&&showinfo=0&autohide=1&loop=1&playlist=aKW5F9uKcbc\" frameborder=\"0\" allowfullscreen></iframe></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I devised a navigation model that doesn't use tabs or or back navigation at all, this allows quick navigation between article list, article detail, article actions and application menu views. This model seems suitable for mobiles as the interaction time when using an app is extremely short compared to, for example, this website. As attention span is short it's more important to see quickly the headlines, read the article and get back to the headlines again. </p><p class=\"\">Oh, remember those nice panoramic images from previous project I did for Al Jazeera? Well, they made their way in to this proposal as well, except here half of the image is used as the headline \"thumbnail\" and the other half as the header image on the article itself</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/secret-mdash/aljz.webp\" alt=\"smaller-projects image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\"><strong>MORE CLEVER THINGS</strong></p>\n</div>\n<div class=\"project-media\"><img src=\"assets/secret-mdash/aljz2.webp\" alt=\"smaller-projects image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">So, news are reported by journalists, but sometimes the readers don't have clue why somethings are happening in the world. Now in the days of Quora and Reddit, where users come together and communicate and explain things, it seems logical that the source of the news should allow the same. We imagined a similar type of service for Al Jazeera, where a user can discuss or contribute to an article. This isn't, however, an ordinary comments thread, but more like Quora, where readers can ask questions about the article and other users or the author of the article can answer to that. </p><p class=\"\">We do this by the following way:</p><p class=\"\">\"Superusers\" are users who contribute much to the content. These users have privileges over ordinary users as they can answer questions in the Q&amp;A sections and moderate contributions. They can also be asked by Al Jazeera to contribute content if, for example, they are in a location where a breaking news story is occurring.</p><p class=\"\">\"Contributions\" are content created by the users. The contributions are multimedia in nature, meaning that they can be text, photos, videos or audio clips. Each contribution can be voted up or down by other users. The ratio between ups and downs determines the contribution's position in the list. The position of the user's posting adds up to her superuser score.</p><p class=\"\">\"Q&amp;A\" are questions related to the article posted by the users. This is because a lot of news have a background that is not obvious to all readers/viewers. An example question could be for example related to an article about South Sudan; “What is the reason for South Sudans recent independence?” Superusers and Al Jazeera correspondents and editors can answer these questions. These answers can also be voted up and down and add up to the Superuser score.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/secret-mdash/aljz3_005.webp\" alt=\"smaller-projects image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Outotec - Particle size analyser</h3><p class=\"\"> </p><p class=\"\"><strong>TL;DR</strong></p><p class=\"\">I designed an interface for a stand-alone machine, that analyses particle sizes in mines from the slurry created in the mining process. This is an Electron app.</p><p class=\"\"> </p><p class=\"\"><strong>Role</strong></p><p class=\"\">I took care of the UX on my own and instructed both the visual designer and front-end developer to carry out my designs. There was an earlier interface running on a special version of Windows CE, that I studied carefully in order to understand how the interface should be built. My task was to re-design everything in the software to better suit a resistive touch screen input and make views and navigation much clearer. I took care of UX matters in direct communication with the client. I instructed the client on future UX creation, as this was the first new type of interface that will be implemented across the product catalogue in future versions, while moving away from old Windows CE systems.</p><p class=\"\"> </p><p class=\"\"><strong>The Machine</strong></p><p class=\"\">The machine needs to be explained in order to understand any of this.</p><p class=\"\">Rock is mined, then the rock is grinded down until it's basically mud water or slurry. Reagents are added to the slurry and minerals are extracted chemically from it. For the mine to be efficient, the particles (the grinded-down rock) need to be of constant size. If they are not, then there is a problem in the grinding process somewhere. The analyser has three different lines coming in from three different grinders. The machine lets in slurry from lines one at a time and lets it flow through it. In the middle of the machine there is a ceramic \"hammer and anvil\" that trap particles between them and measures the size of the particle twice per second. This done for two minutes, after which the machine is flushed with clear water. The machine then checks that the \"hammer and anvil\" meet at value zero. Then the next line opens and and the process is repeated. It's about the size of Michael Jordan and features an embedded touchscreen.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/secret-mdash/static1.squarespace.com_008.webp\" alt=\"smaller-projects image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">What's going on here? So much stuff! True, but for a reason.</p><p class=\"\"> </p><p class=\"\"><strong>Let me explain</strong></p><p class=\"\">This interface needs to glanceable, since the user research showed that users in the mines don't need go so often deeper in the interface than the first screen, where they are presented with all the necessary information.</p><p class=\"\">On the top of the screen is the main navigation arranged in tabs and then two buttons. The other is obviously info screen, but what's the other? Well, as this interface is installed on to a machine that sits in the part of the mine where the minerals are extracted, the environment is dirty to the extreme. Hence, the screen needs to be constantly wiped clean, but as it as a resistive touchscreen, (durable, can be operated with gloves on) the screen needs to be turned off to do the cleaning. So, that button turns off the touch functions and displays a counter from ten to zero, when the user can wipe the screen.</p><p class=\"\">Each tab has under it a group of sub-tabs, shown later. The other tabs and their sub-tabs are rarely accessed and are mostly detailed views or the settings of the main screens.</p><p class=\"\">On the left of the are all the assay assigned to lines and here it's where it gets complicated. See, the machine can measure different things like the acidity or alkalinity of the water in pH or particle size in micrometres or <a href=\"https://en.wikipedia.org/wiki/Mesh_(scale)\" target=\"_blank\">meshes</a> or the slurry density. But assays can be heavily customised to catch any deviations that might occur. So the assays are custom in nature, that's why we gave them no predefined names, rather when the user defines the assays, she also names them.</p><p class=\"\">On the right from top down we have first the machine state as text and then line control buttons. Let's check those later.</p><p class=\"\">Then we have the machine operation animation. We are essentially looking at the profile of the machine on the top the light grey rectangle is the slurry inlet. You can see brown water flowing through it when the slurry is coming in. The various sensors are also marked on the diagram. the \"hammer and anvil\" is the last thing before the pH sensor. It will blink twice a second when measuring.'</p><p class=\"\"> </p><p class=\"\"><strong>The sequence clock</strong></p>\n</div>\n<div class=\"project-media\"><img src=\"assets/secret-mdash/static1.squarespace.com2_008.webp\" alt=\"smaller-projects image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Image taken from the wireframes explain the lower right half of the main view. This the actual operation of the machine explained in an infographic. Let's see the customisation part to understand this better.</p><p class=\"\"> </p><p class=\"\"><strong>Configuring the sequence clock</strong></p><p class=\"\">The sequence clock was designed closely together with Outotec's engineers to get it right. All the switches in the UI are either on/off buttons or in this case three stage buttons. Here, they cycle through the lines. Multiple assays can be taken from the same line, which is most of the times a line is repeated in the sequence several times. It could be also that some lines simply don't produce as much as others. Again, this had to be designed as heavily customisable simplicity.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/secret-mdash/static1.squarespace.com3_008.webp\" alt=\"smaller-projects image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Intel Screensavings - Windows boot UI</h3><p class=\"\">Hoo-boy. This sure is a weird one. Intel can put stuff on computers before Windows boots up. They basically own that few seconds before ol' Bill's OS kicks in. So they asked us to make some kind of UI that would have sponsored content in order to lower the purchasing cost of the computer as well some very small user defined content. And it needed to be in 3D. And you needed to see the previous offers that were there the last time you booted up the computer. And it needed to act like an interactive screensaver if the computer had been idle for a while, hence the name. So... we came up with this one.</p>\n</div>\n<div class=\"project-video\"><iframe src=\"//www.youtube.com/embed/CCtJ5XVovrg?wmode=opaque&enablejsapi=1\" frameborder=\"0\" allowfullscreen></iframe></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I did the UX and animation here. Direct quote from focus group testing: \"It's like Ironman!\" Very strange concept, I must say. Maybe all things designed are not meant to be.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Service design concept for stadiums</h3><p class=\"\">So we did a concept for a digital platform for stadiums and other venues. I was part of the team designing the service, which I then made in to this nifty little animation. Some of the graphics we bought, some I did.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Service concept for a digital real estate company</h3><p class=\"\">This is a whitelabeled concept of a digital real estate company. I did the concept, script and animation directly with our lead designer and art director, not even bothering with the wireframes. This concept was used by an un-named company for their internal purposes.</p>\n</div>\n<div class=\"project-video\"><iframe src=\"//www.youtube.com/embed/yaksvoG3IEo?wmode=opaque&enablejsapi=1\" frameborder=\"0\" allowfullscreen></iframe></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<blockquote><p class=\"\">\"Well, that was some experience. Now just let me adjust the spatial controls and we'll move to another observation point.\"</p></blockquote><blockquote><p class=\"\">-Forrest J. Ackerman</p></blockquote>\n</div>\n",
        "images": [
            "assets/secret-mdash/Frame+8.webp",
            "assets/secret-mdash/aljz.webp",
            "assets/secret-mdash/aljz2.webp",
            "assets/secret-mdash/aljz2_002.webp",
            "assets/secret-mdash/aljz2_003.webp",
            "assets/secret-mdash/aljz2_004.webp",
            "assets/secret-mdash/aljz2_005.webp",
            "assets/secret-mdash/aljz2_006.webp",
            "assets/secret-mdash/aljz2_007.webp",
            "assets/secret-mdash/aljz2_008.webp",
            "assets/secret-mdash/aljz3.webp",
            "assets/secret-mdash/aljz3_002.webp",
            "assets/secret-mdash/aljz3_003.webp",
            "assets/secret-mdash/aljz3_004.webp",
            "assets/secret-mdash/aljz3_005.webp",
            "assets/secret-mdash/aljz3_006.webp",
            "assets/secret-mdash/aljz3_007.webp",
            "assets/secret-mdash/aljz3_008.webp",
            "assets/secret-mdash/aljz_002.webp",
            "assets/secret-mdash/aljz_003.webp",
            "assets/secret-mdash/aljz_004.webp",
            "assets/secret-mdash/aljz_005.webp",
            "assets/secret-mdash/aljz_006.webp",
            "assets/secret-mdash/aljz_007.webp",
            "assets/secret-mdash/aljz_008.webp",
            "assets/secret-mdash/static1.squarespace.com.webp",
            "assets/secret-mdash/static1.squarespace.com2.webp",
            "assets/secret-mdash/static1.squarespace.com2_002.webp",
            "assets/secret-mdash/static1.squarespace.com2_003.webp",
            "assets/secret-mdash/static1.squarespace.com2_004.webp",
            "assets/secret-mdash/static1.squarespace.com2_005.webp",
            "assets/secret-mdash/static1.squarespace.com2_006.webp",
            "assets/secret-mdash/static1.squarespace.com2_007.webp",
            "assets/secret-mdash/static1.squarespace.com2_008.webp",
            "assets/secret-mdash/static1.squarespace.com3.webp",
            "assets/secret-mdash/static1.squarespace.com3_002.webp",
            "assets/secret-mdash/static1.squarespace.com3_003.webp",
            "assets/secret-mdash/static1.squarespace.com3_004.webp",
            "assets/secret-mdash/static1.squarespace.com3_005.webp",
            "assets/secret-mdash/static1.squarespace.com3_006.webp",
            "assets/secret-mdash/static1.squarespace.com3_007.webp",
            "assets/secret-mdash/static1.squarespace.com3_008.webp",
            "assets/secret-mdash/static1.squarespace.com_002.webp",
            "assets/secret-mdash/static1.squarespace.com_003.webp",
            "assets/secret-mdash/static1.squarespace.com_004.webp",
            "assets/secret-mdash/static1.squarespace.com_005.webp",
            "assets/secret-mdash/static1.squarespace.com_006.webp",
            "assets/secret-mdash/static1.squarespace.com_007.webp",
            "assets/secret-mdash/static1.squarespace.com_008.webp"
        ],
        "thumbnail": "assets/secret-mdash/Frame+8.webp",
        "original_file": "Secret — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Dental Radiology Viewer",
        "slug": "dental-radiology-viewer",
        "description": "Planmeca Mromexis dental radiology viewer app TL;DR I designed the UX for a cross-platform app for viewing 3D volumes, X-ray images and patient data. My role I needed to create the concept out of Planmeca's existing products. I did benchmarking and competitor analysis to figure out the best way handle 3D volumes on touch UIs. I was the only UX designer on the project and managed the project on the design directly with the client. I created all the wireframes and interactions and created the basis for the user manual from the documentation. Besides me, Jarkko Lunnas handled the graphics. I also handled the communication directly to the developers, instructing them on getting things right. Brief Bring a dental imaging application to all platforms (iPad, iPhone, Android Tablets and phones, Mac OSX, Windows and Web), while keeping the UI as similar as possible between each platform. Because of the need to render realtime 3D, a cross-platform game engine was used, which posed some challenges for the UI and UX. Another challenge was to create all the gestures to manipulate the 3D viewports. To maximise the space on the viewport, I designed the controls so, that only the icons are visible for quick manipulation and if the arrow in the middle of the control bar is tapped or clicked the controls open in full view. This means that some of the controls are hidden as are the tool descriptions. The top image is the wireframe and bottom image the actual visual design, which follows the wireframe very closely as the client was extremely happy how the wireframes already looked good. There are features in these designs that didn't make it to the currently released application as it was designed for the next release as well. On the left side of the image viewer we have the patient details. This includes the patients name, picture, ID and age. The small bubble will open up general comments on the patient. Below that the \"This Image\" section shows all the comments that different dentists or radiologists or other personnel has written about the image in question. The \"Activities\" section shows all the images taken from the patients in chronological order of their comments i.e. the last commented image is on the top and not the image that was taken the last. There are many type of comments that have a slightly different look. A general comment appears with speech bubble icon, a radiological comment appears as an icon with a hand holding an x-ray. As one patient can have several images depending on the care needed, an image carousel is on the bottom of viewport. These images are in chronological order of the time that they were taken. Here the annotation and measuring tools are used. As an annotation is created a tooltip inside the annotation box is already giving a hint on what to do next. When editing the annotation, a box appears on the bottom of the screen that deletes the annotation when dragged on to. What I learned Stay professional! Study the subject matter fully (in this case: dentistry, radiology, voxels and touch controls), in order to communicate clearly and precisely. I did my homework and things were smooth sailing from the beginning. By delivering more than the minimum viable product (some parts were already added in to the app, but never implemented), but within the budget and time constraints, the client stays happy and comes back for more.",
        "short_description": "Planmeca Mromexis dental radiology viewer app TL;DR I designed the UX for a cross-platform app for viewing 3D volumes, X-ray images and patient data. My role I needed to create the concept out of...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Planmeca</h1><h2>Mromexis dental radiology viewer app</h2>\n</div>\n<div class=\"project-media\"><img src=\"assets/dental-radiology-viewer-mdash/image-asset_002.webp\" alt=\"dental-radiology-viewer image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>TL;DR</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I designed the UX for a cross-platform app for viewing 3D volumes, X-ray images and patient data.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>My role</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I needed to create the concept out of Planmeca's existing products. I did benchmarking and competitor analysis to figure out the best way handle 3D volumes on touch UIs. </p><p class=\"\">I was the only UX designer on the project and managed the project on the design directly with the client. I created all the wireframes and interactions and created the basis for the user manual from the documentation. </p><p class=\"\">Besides me, Jarkko Lunnas handled the graphics. I also handled the communication directly to the developers, instructing them on getting things right.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Brief</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Bring a dental imaging application to all platforms (iPad, iPhone, Android Tablets and phones, Mac OSX, Windows and Web), while keeping the UI as similar as possible between each platform. </p><p class=\"\">Because of the need to render realtime 3D, a cross-platform game engine was used, which posed some challenges for the UI and UX. </p><p class=\"\">Another challenge was to create all the gestures to manipulate the 3D viewports. </p>\n</div>\n<div class=\"project-media\"><img src=\"assets/dental-radiology-viewer-mdash/image-asset_040.webp\" alt=\"dental-radiology-viewer image\"></div><div class=\"project-media\"><img src=\"assets/dental-radiology-viewer-mdash/image-asset_005.webp\" alt=\"dental-radiology-viewer image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">To maximise the space on the viewport, I designed the controls so, that only the icons are visible for quick manipulation and if the arrow in the middle of the control bar is tapped or clicked the controls open in full view. This means that some of the controls are hidden as are the tool descriptions. </p><p class=\"\">The top image is the wireframe and bottom image the actual visual design, which follows the wireframe very closely as the client was extremely happy how the wireframes already looked good. </p><p class=\"\">There are features in these designs that didn't make it to the currently released application as it was designed for the next release as well.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/dental-radiology-viewer-mdash/image-asset_039.webp\" alt=\"dental-radiology-viewer image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">On the left side of the image viewer we have the patient details. This includes the patients name, picture, ID and age. </p><p class=\"\">The small bubble will open up general comments on the patient. Below that the \"This Image\" section shows all the comments that different dentists or radiologists or other personnel has written about the image in question. </p><p class=\"\">The \"Activities\" section shows all the images taken from the patients in chronological order of their comments i.e. the last commented image is on the top and not the image that was taken the last. </p><p class=\"\">There are many type of comments that have a slightly different look. A general comment appears with speech bubble icon, a radiological comment appears as an icon with a hand holding an x-ray. </p><p class=\"\">As one patient can have several images depending on the care needed, an image carousel is on the bottom of viewport. These images are in chronological order of the time that they were taken. </p>\n</div>\n<div class=\"project-media\"><img src=\"assets/dental-radiology-viewer-mdash/image-asset_038.webp\" alt=\"dental-radiology-viewer image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Here the annotation and measuring tools are used. As an annotation is created a tooltip inside the annotation box is already giving a hint on what to do next. </p><p class=\"\">When editing the annotation, a box appears on the bottom of the screen that deletes the annotation when dragged on to.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>What I learned</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Stay professional! Study the subject matter fully (in this case: dentistry, radiology, voxels and touch controls), in order to communicate clearly and precisely. I did my homework and things were smooth sailing from the beginning. </p><p class=\"\">By delivering more than the minimum viable product (some parts were already added in to the app, but never implemented), but within the budget and time constraints, the client stays happy and comes back for more.</p>\n</div>\n",
        "images": [
            "assets/dental-radiology-viewer-mdash/Frame+8.webp",
            "assets/dental-radiology-viewer-mdash/image-asset.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_002.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_003.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_004.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_005.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_006.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_007.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_008.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_009.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_010.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_011.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_012.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_013.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_014.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_015.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_016.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_017.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_018.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_019.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_020.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_021.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_022.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_023.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_024.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_025.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_026.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_027.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_028.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_029.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_030.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_031.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_032.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_033.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_034.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_035.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_036.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_037.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_038.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_039.webp",
            "assets/dental-radiology-viewer-mdash/image-asset_040.webp"
        ],
        "thumbnail": "assets/dental-radiology-viewer-mdash/Frame+8.webp",
        "original_file": "Dental Radiology Viewer — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Experiments",
        "slug": "experiments",
        "description": "Experiments I designed a remote for an Android based TV project done in-house at Ixonos/Digitalist. Sort of like Magic Mouse meets the Wiimote. There is the possibility to control the TV from your phone as well. Fun little HW design exercise. Click to embiggen. Magic remote. Kill the light. Literally. Kill. The. Light. I made an alarm clock for people start their day off on the wrong foot. The alarm goes off when the sun rises, because it's sensitive to light. Some people have electromagentic hypersensitivity. I met a couple, who lived in a flat that had it's walls painted with carbon. We made a bunch of prototypes that makes electromagnetic radiation audible. I basically made the first one by ripping out the magnetic pick out of an old Sony Walkman and adding an amplifier and a microcontroller to the package. Audible WiFi. This one is made in to a Pringles can with the Walkman pick. This girls used a more sensitive one model with better electronics and a headphone jack and made a nice dance improv to the sounds. I used this as a mass research tool to get the population of the city of Umeå to write or draw their opinions on to glass wall. After they pressed the button the and/or text was sent Twitter, where we just needed to look at the answers and see where to make the city safer for bikers and pedestrians. The whole thing was a clever hack since the trackers on the pens didn't have any API to get info out. I just used a bunch automation scripts and macros to monitor what happens on the screen and then just send it to Twitter. Handwritten Twitter. The social bag. The original idea was to remove the excess boredom people feel every now and then, by adding elements in opening a package that would make it to have a locking mechanism in similar vein to Japanese puzzle boxes or other mechanical puzzles, such as the Rubik’s cube. Boredom patrol At this point I came to realise that I don’t know enough about boredom. I interviewed a few people asking them what they when they are bored. Most of the answers were related to modern day technological gadgets: “I'll fiddle around with my phone” or “I'll watch movies on my laptop”. I started to think if this over-avoidance of boredom is really good for us at all. The bag So, pack away all your distractions and let's get bored! Usually people use hand/shoulder bags to carry their distractions around. A shoulder bag is the right size to play with interactivity. Getting the previous ideas together and implementing them to a usable object I built The social bag. Just the right amount of boredom, but when you want some relief, you need to get social. Here is how the bag works: - You are bored, waiting for something to happen. - You desperately want to use your array of gadgetry visible to you in your bag. - You decide to open it, just to send a “I’m bored” message to one of your friends. - You remember that you can’t open the bag by yourself. - You start looking for someone equally bored. - You explain that you require assistance with opening the bag to the other boree. - Together you manage to get the bag open. - Unboredom!",
        "short_description": "Experiments I designed a remote for an Android based TV project done in-house at Ixonos/Digitalist. Sort of like Magic Mouse meets the Wiimote. There is the possibility to control the TV from your...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Experiments</h1>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I designed a remote for an Android based TV project done in-house at Ixonos/Digitalist. </p><p class=\"\">Sort of like Magic Mouse meets the Wiimote. There is the possibility to control the TV from your phone as well. Fun little HW design exercise. </p><p class=\"\"><strong>Click to embiggen.</strong></p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Magic remote.</h3>\n</div>\n<div class=\"project-gallery-grid\"><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_01_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_02_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_03_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_04_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_05_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_06_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_08_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_09_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_10_Image_0001.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/experiments-mdash/remote_project_Page_07_Image_0001.webp\" alt=\"gallery image\"></div></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Kill the light.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Literally. Kill. The. Light. I made an alarm clock for people start their day off on the wrong foot. The alarm goes off when the sun rises, because it's sensitive to light.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/experiments-mdash/ac1.webp\" alt=\"experiments image\"></div><div class=\"project-media\"><img src=\"assets/experiments-mdash/ac2.webp\" alt=\"experiments image\"></div><div class=\"project-media\"><img src=\"assets/experiments-mdash/Untitled-7.gif\" alt=\"experiments image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Some people have electromagentic hypersensitivity. I met a couple, who lived in a flat that had it's walls painted with carbon. We made a bunch of prototypes that makes electromagnetic radiation audible. I basically made the first one by ripping out the magnetic pick out of an old Sony Walkman and adding an amplifier and a microcontroller to the package.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Audible WiFi.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This one is made in to a Pringles can with the Walkman pick.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This girls used a more sensitive one model with better electronics and a headphone jack and made a nice dance improv to the sounds.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I used this as a mass research tool to get the population of the city of Umeå to write or draw their opinions on to glass wall.</p><p class=\"\">After they pressed the button the and/or text was sent Twitter, where we just needed to look at the answers and see where to make the city safer for bikers and pedestrians. </p><p class=\"\">The whole thing was a clever hack since the trackers on the pens didn't have any API to get info out. I just used a bunch automation scripts and macros to monitor what happens on the screen and then just send it to Twitter.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Handwritten Twitter.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/experiments-mdash/Capture.webp\" alt=\"experiments image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The social bag.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/experiments-mdash/IMG000086.webp\" alt=\"experiments image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">The original idea was to remove the excess boredom people feel every now and then, by adding elements in opening a package that would make it to have a locking mechanism in similar vein to Japanese puzzle boxes or other mechanical puzzles, such as the Rubik’s cube.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/experiments-mdash/Untitled-1.webp\" alt=\"experiments image\"></div><div class=\"project-media\"><img src=\"assets/experiments-mdash/Untitled-3.webp\" alt=\"experiments image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\"><strong>Boredom patrol</strong></p><p class=\"\">At this point I came to realise that I don’t know enough about boredom. I interviewed a few people asking them what they when they are bored. Most of the answers were related to modern day technological gadgets: “I'll fiddle around with my phone” or “I'll watch movies on my laptop”. I started to think if this over-avoidance of boredom is really good for us at all.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/experiments-mdash/Untitled-4.webp\" alt=\"experiments image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\"><strong>The bag</strong></p><p class=\"\">So, pack away all your distractions and let's get bored! Usually people use hand/shoulder bags to carry their distractions around. A shoulder bag is the right size to play with interactivity. Getting the previous ideas together and implementing them to a usable object I built The social bag. Just the right amount of boredom, but when you want some relief, you need to get social.</p><p class=\"\">Here is how the bag works:<br/>- You are bored, waiting for something to happen.<br/>- You desperately want to use your array of gadgetry visible to you in your bag.<br/>- You decide to open it, just to send a “I’m bored” message to one of your friends.<br/>- You remember that you can’t open the bag by yourself.<br/>- You start looking for someone equally bored.<br/>- You explain that you require assistance with opening the bag to the other boree.<br/>- Together you manage to get the bag open.<br/>- Unboredom!<br/> </p>\n</div>\n<div class=\"project-media\"><img src=\"assets/experiments-mdash/bag1.webp\" alt=\"experiments image\"></div><div class=\"project-media\"><img src=\"assets/experiments-mdash/P1010558.gif\" alt=\"experiments image\"></div>",
        "images": [
            "assets/experiments-mdash/Capture.webp",
            "assets/experiments-mdash/Capture_002.webp",
            "assets/experiments-mdash/Capture_003.webp",
            "assets/experiments-mdash/Capture_004.webp",
            "assets/experiments-mdash/Capture_005.webp",
            "assets/experiments-mdash/Capture_006.webp",
            "assets/experiments-mdash/Capture_007.webp",
            "assets/experiments-mdash/Capture_008.webp",
            "assets/experiments-mdash/Frame+8.webp",
            "assets/experiments-mdash/IMG000086.webp",
            "assets/experiments-mdash/IMG000086_002.webp",
            "assets/experiments-mdash/IMG000086_003.webp",
            "assets/experiments-mdash/IMG000086_004.webp",
            "assets/experiments-mdash/IMG000086_005.webp",
            "assets/experiments-mdash/IMG000086_006.webp",
            "assets/experiments-mdash/IMG000086_007.webp",
            "assets/experiments-mdash/IMG000086_008.webp",
            "assets/experiments-mdash/P1010558.gif",
            "assets/experiments-mdash/P1010558_002.gif",
            "assets/experiments-mdash/P1010558_003.gif",
            "assets/experiments-mdash/P1010558_004.gif",
            "assets/experiments-mdash/P1010558_005.gif",
            "assets/experiments-mdash/P1010558_006.gif",
            "assets/experiments-mdash/P1010558_007.gif",
            "assets/experiments-mdash/P1010558_008.gif",
            "assets/experiments-mdash/Untitled-1.webp",
            "assets/experiments-mdash/Untitled-1_002.webp",
            "assets/experiments-mdash/Untitled-1_003.webp",
            "assets/experiments-mdash/Untitled-1_004.webp",
            "assets/experiments-mdash/Untitled-1_005.webp",
            "assets/experiments-mdash/Untitled-1_006.webp",
            "assets/experiments-mdash/Untitled-1_007.webp",
            "assets/experiments-mdash/Untitled-1_008.webp",
            "assets/experiments-mdash/Untitled-3.webp",
            "assets/experiments-mdash/Untitled-3_002.webp",
            "assets/experiments-mdash/Untitled-3_003.webp",
            "assets/experiments-mdash/Untitled-3_004.webp",
            "assets/experiments-mdash/Untitled-3_005.webp",
            "assets/experiments-mdash/Untitled-3_006.webp",
            "assets/experiments-mdash/Untitled-3_007.webp",
            "assets/experiments-mdash/Untitled-3_008.webp",
            "assets/experiments-mdash/Untitled-4.webp",
            "assets/experiments-mdash/Untitled-4_002.webp",
            "assets/experiments-mdash/Untitled-4_003.webp",
            "assets/experiments-mdash/Untitled-4_004.webp",
            "assets/experiments-mdash/Untitled-4_005.webp",
            "assets/experiments-mdash/Untitled-4_006.webp",
            "assets/experiments-mdash/Untitled-4_007.webp",
            "assets/experiments-mdash/Untitled-4_008.webp",
            "assets/experiments-mdash/Untitled-7.gif",
            "assets/experiments-mdash/Untitled-7_002.gif",
            "assets/experiments-mdash/Untitled-7_003.gif",
            "assets/experiments-mdash/Untitled-7_004.gif",
            "assets/experiments-mdash/Untitled-7_005.gif",
            "assets/experiments-mdash/Untitled-7_006.gif",
            "assets/experiments-mdash/Untitled-7_007.gif",
            "assets/experiments-mdash/Untitled-7_008.gif",
            "assets/experiments-mdash/ac1.webp",
            "assets/experiments-mdash/ac1_002.webp",
            "assets/experiments-mdash/ac1_003.webp",
            "assets/experiments-mdash/ac1_004.webp",
            "assets/experiments-mdash/ac1_005.webp",
            "assets/experiments-mdash/ac1_006.webp",
            "assets/experiments-mdash/ac1_007.webp",
            "assets/experiments-mdash/ac1_008.webp",
            "assets/experiments-mdash/ac2.webp",
            "assets/experiments-mdash/ac2_002.webp",
            "assets/experiments-mdash/ac2_003.webp",
            "assets/experiments-mdash/ac2_004.webp",
            "assets/experiments-mdash/ac2_005.webp",
            "assets/experiments-mdash/ac2_006.webp",
            "assets/experiments-mdash/ac2_007.webp",
            "assets/experiments-mdash/ac2_008.webp",
            "assets/experiments-mdash/bag1.webp",
            "assets/experiments-mdash/bag1_002.webp",
            "assets/experiments-mdash/bag1_003.webp",
            "assets/experiments-mdash/bag1_004.webp",
            "assets/experiments-mdash/bag1_005.webp",
            "assets/experiments-mdash/bag1_006.webp",
            "assets/experiments-mdash/bag1_007.webp",
            "assets/experiments-mdash/bag1_008.webp",
            "assets/experiments-mdash/remote_project_Page_01_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_02_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_03_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_04_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_05_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_06_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_07_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_08_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_09_Image_0001.webp",
            "assets/experiments-mdash/remote_project_Page_10_Image_0001.webp"
        ],
        "thumbnail": "assets/expi2.png",
        "original_file": "experiments — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Volvo Build & Price",
        "slug": "volvo-build-price",
        "description": "Volvo Car configurator and online sales strategy Summary. As part of continuous process of improving Volvo’s online car configurator I took the task of fixing the old problems while at the same time creating something completely new. Let’s take a look where we landed with the fixes. This work started with an initial design system already in place, so we did very little hand sketching and just used the existing components to rapidly churn out designs. We also started to add things and use a more proper design system at the same time while moving to Figma. Parallel design tracks. At the same time, I did a parallel track on the whole revamp of online car buying journey. You can skip to that track by pressing this button. Track one. Gradual improvements in Agile fashion. Sprint one. To start the process we held standard GV design sprint with all the stakeholders. The idea was to pinpoint the problems the current site is experiencing when looking at analytics. We traced the biggest problem to the very first page of the car configurator - selecting the trim level. We already had a bunch of testing done for us regarding the page, so we had a starting point at least. We did an assumption based on the research available; people don’t actually understand what the differences between trim levels are. The cars sort of look the same and the features sound a bit non-sensical. Therefore our initial designs included a screen with giant imagery and a piece of copy explaining what the trim level is supposed to be. “Our starting point was this extract from Tableau. It clearly shows that we had a problem with trim selection” In testing this prototype, our carousel was not well received and people just blazed through it without looking at trims at all. We conducted the testing using Userzoom and remote partcipants for the first 3 prototypes. Sprint two. For our second prototype we mixed things up a bit. Trying to digest all the information we got from the user test our first goal was to fix the issues we found out. Our second sprint was all about adding functionality to compare the trims against each other with a simple user interface. We removed the carousel and put the different cars under each other so it’s easier to see the trims. We also put the price tag right there, so people would understand that they are getting more bang for their buck. Finally, in the second selection page we included a “Compare trims” link for people to quickly compare the different cars. Again, we tested 20 people remotely. It was now crystal clear for us to remove all references to ‘trims’. Half of the respondents didn’t understand the word trim at all. And people still found that first selection screen more of a distraction than helping them select the correct trim level. Sprint six. We removed all references to ‘trims’, the initial selection page, minimised the gallery to a thumbnail and condensed the information to be glanceable and as minimal as possible. Here is a user testing video of the prototypes. Conclusion. These are the conclusions after we tested these prototypes. At this point we just did guerrilla testing as it far more easier and faster. I tested our prototypes against these hypotheses and described my findings underneath. Starting from scratch. At the same time while we (UI designer and me) were creating and testing improvements to the old system, I started track that looked the car buying process from a customer perspective. By using the data and insights we gathered thoughout the improvement track, Google’s excellent car buying process research , and our own data on which cars people mostly buy, we created 5 hypotheses to kick us off. Flowchart. I created this flowchart to illustrate how this this system would work based on the synthesis of all the research we did over the months. Our main insight was that people don’t want to start with a blank canvas, but rather modify to suit their needs, hence we would start the journey by already having a car built and the price tag attached. Design and end result. This was our end-goal, a car that has all of the decisions already made. This simplifies the cognitive load for people on their customisation process by having the choices pre-made and seeing the price tag change in real time with each decision when changing little decision. We wanted to be the digital car salesman, selling cars by the lifestyle rather than customers deciding what suits them through long-winded process. Again, the design system we started with the design team made it so quick to iterate and create these designs on the fly. The current site looks a bit different now that the new design system is fully fleshed out.",
        "short_description": "Volvo Car configurator and online sales strategy Summary. As part of continuous process of improving Volvo’s online car configurator I took the task of fixing the old problems while at the same...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Volvo</h1><h2>Car configurator and online sales strategy</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">As part of continuous process of improving Volvo’s online car configurator I took the task of fixing the old problems while at the same time creating something completely new. Let’s take a look where we landed with the fixes.</p><p class=\"\">This work started with an initial design system already in place, so we did very little hand sketching and just used the existing components to rapidly churn out designs. We also started to add things and use a more proper design system at the same time while moving to Figma.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Parallel design tracks.</h3><p class=\"\">At the same time, I did a parallel track on the whole revamp of online car buying journey. You can skip to that track by pressing this button.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h2>Track one.</h2><h3>Gradual improvements in Agile fashion.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Sprint one.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">To start the process we held standard GV design sprint with all the stakeholders. The idea was to pinpoint the problems the current site is experiencing when looking at analytics. </p><p class=\"\">We traced the biggest problem to the very first page of the car configurator - selecting the trim level.</p><p class=\"\">We already had a bunch of testing done for us regarding the page, so we had a starting point at least. </p><p class=\"\">We did an assumption based on the research available; people don’t actually understand what the differences between trim levels are. The cars sort of look the same and the features sound a bit non-sensical.</p><p class=\"\">Therefore our initial designs included a screen with giant imagery and a piece of copy explaining what the trim level is supposed to be.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_007.webp\" alt=\"volvo-build-price image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<blockquote><p class=\"\">“Our starting point was this extract from Tableau. It clearly shows that we had a problem with trim selection”</p></blockquote>\n</div>\n<div class=\"project-media\"><img src=\"assets/volvo-build-amp-price/thumb_t-sel-momentum@2x.webp\" alt=\"volvo-build-price image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">In testing this prototype, our carousel was not well received and people just blazed through it without looking at trims at all. </p><p class=\"\">We conducted the testing using Userzoom and remote partcipants for the first 3 prototypes.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Sprint two.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">For our second prototype we mixed things up a bit. Trying to digest all the information we got from the user test our first goal was to fix the issues we found out. </p><p class=\"\">Our second sprint was all about adding functionality to compare the trims against each other with a simple user interface.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/volvo-build-amp-price/1+start@2x.webp\" alt=\"volvo-build-price image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">We removed the carousel and put the different cars under each other so it’s easier to see the trims. We also put the price tag right there, so people would understand that they are getting more bang for their buck. </p><p class=\"\">Finally, in the second selection page we included a “Compare trims” link for people to quickly compare the different cars.<br/></p><p class=\"\">Again, we tested 20 people remotely. It was now crystal clear for us to remove all references to ‘trims’.</p><p class=\"\">Half of the respondents didn’t understand the word trim at all. And people still found that first selection screen more of a distraction than helping them select the correct trim level.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Sprint six.</h3>\n</div>\n<div class=\"project-video\"><iframe src=\"Volvo%20Build%20&%20Price%20%E2%80%94%20Mikkopi%20-%20PORTFOLIO_files/gNuDFykSX5U.html\" frameborder=\"0\" allowfullscreen></iframe></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">We removed all references to ‘trims’, the initial selection page, minimised the gallery to a thumbnail and condensed the information to be glanceable and as minimal as possible. </p><p class=\"\">Here is a user testing video of the prototypes.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Conclusion.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">These are the conclusions after we tested these prototypes. At this point we just did guerrilla testing as it far more easier and faster.</p><p class=\"\">I tested our prototypes against these hypotheses and described my findings underneath.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Starting from scratch.</h3>\n</div>\n<div class=\"project-media\"><img src=\"assets/volvo-build-amp-price/yfehBQh_00000_007.webp\" alt=\"volvo-build-price image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">At the same time while we (UI designer and me) were creating and testing improvements to the old system, I started track that looked the car buying process from a customer perspective. </p><p class=\"\">By using the data and insights we gathered thoughout the improvement track, <a href=\"https://www.thinkwithgoogle.com/consumer-insights/consumer-trends/consumer-car-buying-process-reveals-auto-marketing-opportunities/\">Google’s excellent car buying process research</a>, and our own data on which cars people mostly buy, we created 5 hypotheses to kick us off.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/volvo-build-amp-price/b&pMAP+copy_005.webp\" alt=\"volvo-build-price image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Flowchart.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I created this flowchart to illustrate how this this system would work based on the synthesis of all the research we did over the months. Our main insight was that people don’t want to start with a blank canvas, but rather modify to suit their needs, hence we would start the journey by already having a car built and the price tag attached.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Design and end result.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This was our end-goal, a car that has all of the decisions already made. </p><p class=\"\"><br/>This simplifies the cognitive load for people on their customisation process by having the choices pre-made and seeing the price tag change in real time with each decision when changing little decision.</p><p class=\"\"><br/>We wanted to be the digital car salesman, selling cars by the lifestyle rather than customers deciding what suits them through long-winded process.</p><p class=\"\"><br/>Again, the design system we started with the design team made it so quick to iterate and create these designs on the fly.</p><p class=\"\">The current site looks a bit different now that the new design system is fully fleshed out.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/volvo-build-amp-price/Surface+Book+5.48.webp\" alt=\"volvo-build-price image\"></div><div class=\"project-media\"><img src=\"assets/volvo-build-amp-price/vol.webp\" alt=\"volvo-build-price image\"></div>",
        "images": [
            "assets/volvo-build-amp-price/1+start@2x.webp",
            "assets/volvo-build-amp-price/1+start@2x_002.webp",
            "assets/volvo-build-amp-price/1+start@2x_003.webp",
            "assets/volvo-build-amp-price/1+start@2x_004.webp",
            "assets/volvo-build-amp-price/1+start@2x_005.webp",
            "assets/volvo-build-amp-price/1+start@2x_006.webp",
            "assets/volvo-build-amp-price/1+start@2x_007.webp",
            "assets/volvo-build-amp-price/1+start@2x_008.webp",
            "assets/volvo-build-amp-price/Frame+24.webp",
            "assets/volvo-build-amp-price/Frame+25.webp",
            "assets/volvo-build-amp-price/Frame+26.webp",
            "assets/volvo-build-amp-price/Frame+27.webp",
            "assets/volvo-build-amp-price/Frame+28.webp",
            "assets/volvo-build-amp-price/Frame+8.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_002.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_003.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_004.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_005.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_006.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_007.webp",
            "assets/volvo-build-amp-price/Screenshot+2021-06-07+at+10.15.12_008.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48_002.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48_003.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48_004.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48_005.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48_006.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48_007.webp",
            "assets/volvo-build-amp-price/Surface+Book+5.48_008.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy_002.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy_003.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy_004.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy_005.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy_006.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy_007.webp",
            "assets/volvo-build-amp-price/b&pMAP+copy_008.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x_002.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x_003.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x_004.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x_005.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x_006.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x_007.webp",
            "assets/volvo-build-amp-price/thumb_t-sel-momentum@2x_008.webp",
            "assets/volvo-build-amp-price/vol.webp",
            "assets/volvo-build-amp-price/vol_002.webp",
            "assets/volvo-build-amp-price/vol_003.webp",
            "assets/volvo-build-amp-price/vol_004.webp",
            "assets/volvo-build-amp-price/vol_005.webp",
            "assets/volvo-build-amp-price/vol_006.webp",
            "assets/volvo-build-amp-price/vol_007.webp",
            "assets/volvo-build-amp-price/vol_008.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000_002.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000_003.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000_004.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000_005.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000_006.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000_007.webp",
            "assets/volvo-build-amp-price/yfehBQh_00000_008.webp"
        ],
        "thumbnail": "assets/volvo-build-amp-price/1+start@2x.webp",
        "original_file": "Volvo Build & Price — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Samsung Galaxy J Prime series",
        "slug": "samsung-j-series",
        "description": "Samsung Galaxy J Prime-series - Feature set Summary. I was lead UX designer for Samsung Galaxy J-series’ second iteration. Coming up with features that would make sense in the low-end market. I got to do proper user research with ethnography and focus groups in India with the actual potential users. I also worked closely together with R&D and the entire engineering team to actually make the features happen. Forbes calls one of the features ‘Sublime’: Read about it here. “This was the phone we designed the features for. The phone’s price was around 60 USD and the brief told us not to increase the Bill of Materials for more than 1 dollar” The team & my roles. 1 Project Manager, 1 Design Lead (me), 6 User Researchers (one of them, me), 4 UX Designers (me again), 1 Design Strategist, 1 Visual Designer, 2 Front-end Developers, 2 video/motion graphic designers (still me as one of them). This project lasted 6 months with approximately half of the time spent in Delhi and Bengaluru. The project can approximately be divided to four phases. Phase 1: Sacrificial concepts. Keeping everything within the budget and BOM costs we created approximately 100 concepts and small drawings that approximately looked like this to accompany them. We then voted within the team and the client’s team which 30 would go to the next phase as discussion pieces. “This is my concept drawing. I think my rickshaw looks good” Phase 2: User research in India Take 1 UX designer from Samsung, 1 project manager, 1 lead designer, 4 user researchers, put everything on to a plane to India. Invite 2 more user researchers from TNS Global to join. Serve with momos . Take your crew to meet Indian tech experts and and do a focus group session with them and lead users. Use the same props and discussion pieces  (30 sacrificial concepts, magic device drawings and circle of influence) to practice on them before heading out to meet the consumers. Go shopping. Visit multi-brand electronic stores, small ‘mom-and-pop’ vendors and Samsung flagship stores. Interview the staff to get a feeling what type of people buy what type of phones and what their main wishes and concerns are. Yield: 14 shadowing sessions, 11 ‘shop along’ sessions, 2 lead user focus group workshops, 2 tech expert workshops. Archetypes & research synthesis. Collect all your consumer research, shop along sessions and focus group discussions and combine with quality desk research. Make sure that the desk research is fresh. You should now have a solid synthesis report including archetypes that you can pit your designs against and general themes with insights that your designs should fall in. Yield: 1 synthesis report, 4 user archetypes. Phase 3: Concept design Take the synthesis report created in the previous phase. Carefully extract the archetypes and themes and put them in a bowl with your sacrificial concepts. Mix all together with 4 UX designers, 4 workshops in 2 Samsung R&D centres with 50 enigneers. Your concepts should start to make sense now. We did wireframes, experiential prototypes, service design blueprints, 3D illustrations, high-fidelity concept drawings. You name it, we did it. These were all done with Samsung’s engineers to make sure the concepts are doable within the time, budget and BOM costs. Yield: 10 concepts. Phase 4: Concept refinement Take your front-devs out. Throw them in a bowl with yourself, a visual designer and a junior UX designer.  Make every concept shine like a diamond. Travel to India for 8 focus group sessions and nail your final three concepts. Create 3 highly-polished walkthrough videos of the concepts. Conclusion. One of the insights led to the creation of a security feature that a lot of users had already downloaded by themselves or wanted to have. We just made it a part of the operating system so it is easy for users to access and secure their files. This feature is now on all Samsung phones and can be found under the name of ‘Secure folder’, but it all started with the J-series and one haphazard user who kept passport photos on his phone. Below left, the concept and on the right the execution on my Samsung phone.",
        "short_description": "Samsung Galaxy J Prime-series - Feature set Summary. I was lead UX designer for Samsung Galaxy J-series’ second iteration. Coming up with features that would make sense in the low-end market. I got...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Samsung</h1><h2>Galaxy J Prime-series - Feature set</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I was lead UX designer for Samsung Galaxy J-series’ second iteration. Coming up with features that would make sense in the low-end market.</p><p class=\"\"><br/>I got to do proper user research with ethnography and focus groups in India with the actual potential users. <br/>I also worked closely together with R&amp;D and the entire engineering team to actually make the features happen.</p><p class=\"\"><br/>Forbes calls one of the features ‘Sublime’: <a href=\"https://www.forbes.com/sites/daveywinder/2020/08/01/this-samsung-security-app-has-passed-1-billion-downloads-heres-why-secure-folder-privacy/\">Read about it here.</a></p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<blockquote><p class=\"\">“This was the phone we designed the features for. </p><p class=\"\">The phone’s price was around 60 USD and the brief told us not to increase the Bill of Materials for more than 1 dollar”</p></blockquote>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The team &amp; my roles.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">1 Project Manager, 1 Design Lead (me), 6 User Researchers (one of them, me), 4 UX Designers (me again), 1 Design Strategist, 1 Visual Designer, 2 Front-end Developers, 2 video/motion graphic designers (still me as one of them).</p><p class=\"\">This project lasted 6 months with approximately half of the time spent in Delhi and Bengaluru.</p><p class=\"\">The project can approximately be divided to four phases.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Phase 1: Sacrificial concepts.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Keeping everything within the budget and BOM costs we created approximately 100 concepts and small drawings that approximately looked like this to accompany them. We then voted within the team and the client’s team which 30 would go to the next phase as discussion pieces.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/samsung-j-series/idea2.webp\" alt=\"samsung-j-series image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<blockquote><p class=\"\">“This is my concept drawing. I think my rickshaw looks good”</p></blockquote>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Phase 2: User research in India</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Take 1 UX designer from Samsung, 1 project manager, 1 lead designer, 4 user researchers, put everything on to a plane to India. Invite 2 more user researchers from TNS Global to join. Serve with <a href=\"https://en.wikipedia.org/wiki/Momo_(food)\">momos</a>.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/samsung-j-series/samfoc.webp\" alt=\"samsung-j-series image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Take your crew to meet Indian tech experts and and do a focus group session with them and lead users. Use the same props and discussion pieces  (30 sacrificial concepts, magic device drawings and circle of influence) to practice on them before heading out to meet the consumers. </p><p class=\"\">Go shopping. Visit multi-brand electronic stores, small ‘mom-and-pop’ vendors and Samsung flagship stores. Interview the staff to get a feeling what type of people buy what type of phones and what their main wishes and concerns are.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/samsung-j-series/p2dudes.webp\" alt=\"samsung-j-series image\"></div><div class=\"project-media\"><img src=\"assets/samsung-j-series/magic.webp\" alt=\"samsung-j-series image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\"><strong>Yield: </strong>14 shadowing sessions, 11 ‘shop along’ sessions, 2 lead user focus group workshops, 2 tech expert workshops.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Archetypes &amp; research synthesis.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Collect all your consumer research, shop along sessions and focus group discussions and combine with quality desk research. Make sure that the desk research is fresh. You should now have a solid synthesis report including archetypes that you can pit your designs against and general themes with insights that your designs should fall in. </p><p class=\"\"><strong>Yield: </strong>1 synthesis report, 4 user archetypes.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1.webp\" alt=\"samsung-j-series image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Phase 3: Concept design</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Take the synthesis report created in the previous phase. Carefully extract the archetypes and themes and put them in a bowl with your sacrificial concepts. Mix all together with 4 UX designers, 4 workshops in 2 Samsung R&amp;D centres with 50 enigneers. </p><p class=\"\">Your concepts should start to make sense now.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/samsung-j-series/p3d_007.webp\" alt=\"samsung-j-series image\"></div><div class=\"project-media\"><img src=\"assets/samsung-j-series/p3res_007.webp\" alt=\"samsung-j-series image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">We did wireframes, experiential prototypes, service design blueprints, 3D illustrations, high-fidelity concept drawings. You name it, we did it. These were all done with Samsung’s engineers to make sure the concepts are doable within the time, budget and BOM costs.</p><p class=\"\"><strong>Yield:</strong>  10 concepts.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Phase 4: Concept refinement</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Take your front-devs out. Throw them in a bowl with yourself, a visual designer and a junior UX designer.  Make every concept shine like a diamond. Travel to India for 8 focus group sessions and nail your final three concepts. Create 3 highly-polished walkthrough videos of the concepts.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/samsung-j-series/cap1.webp\" alt=\"samsung-j-series image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Conclusion.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">One of the insights led to the creation of a security feature that a lot of users had already downloaded by themselves or wanted to have. We just made it a part of the operating system so it is easy for users to access and secure their files.</p><p class=\"\"><br/>This feature is now on all Samsung phones and can be found under the name of ‘Secure folder’, but it all started with the J-series and one haphazard user who kept passport photos on his phone.</p><p class=\"\">Below left, the concept and on the right the execution on my Samsung phone.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1.webp\" alt=\"samsung-j-series image\"></div><div class=\"project-media\"><img src=\"assets/samsung-j-series/signal-2021-03-29-231325+1.webp\" alt=\"samsung-j-series image\"></div>",
        "images": [
            "assets/samsung-j-series/Frame+8.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1_002.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1_003.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1_004.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1_005.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1_006.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1_007.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.48+1_008.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1_002.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1_003.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1_004.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1_005.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1_006.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1_007.webp",
            "assets/samsung-j-series/Screenshot+2021-03-29+at+22.52+1_008.webp",
            "assets/samsung-j-series/cap1.webp",
            "assets/samsung-j-series/cap1_002.webp",
            "assets/samsung-j-series/cap1_003.webp",
            "assets/samsung-j-series/cap1_004.webp",
            "assets/samsung-j-series/cap1_005.webp",
            "assets/samsung-j-series/cap1_006.webp",
            "assets/samsung-j-series/cap1_007.webp",
            "assets/samsung-j-series/cap1_008.webp",
            "assets/samsung-j-series/idea2.webp",
            "assets/samsung-j-series/idea2_002.webp",
            "assets/samsung-j-series/idea2_003.webp",
            "assets/samsung-j-series/idea2_004.webp",
            "assets/samsung-j-series/idea2_005.webp",
            "assets/samsung-j-series/idea2_006.webp",
            "assets/samsung-j-series/idea2_007.webp",
            "assets/samsung-j-series/idea2_008.webp",
            "assets/samsung-j-series/magic.webp",
            "assets/samsung-j-series/magic_002.webp",
            "assets/samsung-j-series/magic_003.webp",
            "assets/samsung-j-series/magic_004.webp",
            "assets/samsung-j-series/magic_005.webp",
            "assets/samsung-j-series/magic_006.webp",
            "assets/samsung-j-series/magic_007.webp",
            "assets/samsung-j-series/magic_008.webp",
            "assets/samsung-j-series/p2dudes.webp",
            "assets/samsung-j-series/p2dudes_002.webp",
            "assets/samsung-j-series/p2dudes_003.webp",
            "assets/samsung-j-series/p2dudes_004.webp",
            "assets/samsung-j-series/p2dudes_005.webp",
            "assets/samsung-j-series/p2dudes_006.webp",
            "assets/samsung-j-series/p2dudes_007.webp",
            "assets/samsung-j-series/p2dudes_008.webp",
            "assets/samsung-j-series/p3d.webp",
            "assets/samsung-j-series/p3d_002.webp",
            "assets/samsung-j-series/p3d_003.webp",
            "assets/samsung-j-series/p3d_004.webp",
            "assets/samsung-j-series/p3d_005.webp",
            "assets/samsung-j-series/p3d_006.webp",
            "assets/samsung-j-series/p3d_007.webp",
            "assets/samsung-j-series/p3d_008.webp",
            "assets/samsung-j-series/p3res.webp",
            "assets/samsung-j-series/p3res_002.webp",
            "assets/samsung-j-series/p3res_003.webp",
            "assets/samsung-j-series/p3res_004.webp",
            "assets/samsung-j-series/p3res_005.webp",
            "assets/samsung-j-series/p3res_006.webp",
            "assets/samsung-j-series/p3res_007.webp",
            "assets/samsung-j-series/p3res_008.webp",
            "assets/samsung-j-series/samfoc.webp",
            "assets/samsung-j-series/samfoc_002.webp",
            "assets/samsung-j-series/samfoc_003.webp",
            "assets/samsung-j-series/samfoc_004.webp",
            "assets/samsung-j-series/samfoc_005.webp",
            "assets/samsung-j-series/samfoc_006.webp",
            "assets/samsung-j-series/samfoc_007.webp",
            "assets/samsung-j-series/samfoc_008.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1_002.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1_003.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1_004.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1_005.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1_006.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1_007.webp",
            "assets/samsung-j-series/signal-2021-03-29-231325+1_008.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-4g-c.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-_002.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-_003.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-_004.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-_005.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-_006.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-_007.webp",
            "assets/samsung-j-series/smartphone-samsung-galaxy-j7-prime-32gb-pretodual-chip-_008.webp"
        ],
        "thumbnail": "assets/samsung-j-series/Frame+8.webp",
        "original_file": "Samsung J-series — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "National Geographic Birds of North America",
        "slug": "birds-of-north-america",
        "description": "National Geographic Digital birdwatching journal. Summary. I designed an app for birdwatchers, beginners and experts alike. Essentially turning a catalogue book, journal/diary and audio guides in to one comprehensive app. Get the app and read the reviews here: National Geographic Birds: Field Guide to North America . iPhone and iPad versions in a universal app. The pitch. Together with another UX designer, we created a concept for a pitch NatGeo held and won it. Since searching for birds is the main activity, we decided to start immediately with the list of birds. From here swiping right brings the menu with other activities and swiping left the filters for the birds. This animation was part of the pitch that won us the case and not the final app. The brief. Turn a birdwatching field guide with 990 birds in to a meaningful that can be taken with you anywhere you go. Figure out what birdwatchers need, both beginners and experts. Analyse competition and figure out what is missing and what makes an app better than a book. Make ploughing through the pages of the physical copy a breeze with intuitive search tools. Utilise the possibilities that mobile computing could bring to birdwatchers. Keep in mind that birdwatchers are also holding binoculars, so make the app one-hand use. My role. I created about 50% of the concepts, UX and their wireframes and had a really good time doing all this. I also created the small little microinteractions some the icons have in After Effects to create playfulness and visual feedback of succesful interactions. Co-creation workshops. For this project we held participatory design workshops together with one of the illustrators and authors of the physical book as well as National Geographic's representative. In these workshops we created first all the ideas related to just finding the correct bird in the list and then the extra activities users might need. A lot of paper prototypes were created after the ideation workshop, so we could keep the functions and navigation models we want and discard those we don't. This helped us to create the functions and navigation in a very short timeframe. Wireframes & user flow. The app, the whole app and nothing but the app. That's a lot wireframing. Twice a week we changed a bunch them when discussing with the client. Especially the unique feature, digital journal, explained below, demanded a lot of input from National Geographic's bird watching master. We decided to do this type of combined wireframe/user flow system where wireframes are compiled in to logical blocks that is easy to follow. This was before prototyping existed in any meaningful way. Digital journaling. Bird watchers keep a journal of the birds they have spotted. Each watcher has their way to mark up where and when and how they spotted a bird. We desired to bring this journal keeping in to the app, mostly for beginning bird watchers, to keep track of their findings. We imagined this as a strategy to get beginner birdwatchers interested in both birdwatching and the app. Hip youngsters will also share their sightings, so you can Tweet (pun intended) or share via Facebook. Most of the time bird watchers go somewhere to spot birds. In the journal we call these \"events\". This way all the birds you have spotted in a location gets recorded in to an event, along with the weather data as well as GPS coordinates and time and date. Automagically!",
        "short_description": "National Geographic Digital birdwatching journal. Summary. I designed an app for birdwatchers, beginners and experts alike. Essentially turning a catalogue book, journal/diary and audio guides in...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>National Geographic</h1><h2>Digital birdwatching journal. </h2>\n</div>\n<div class=\"project-video\"><iframe src=\"https://www.youtube.com/embed/cZ1HNE4tzwA?\nautoplay=1&controls=0&&showinfo=0&autohide=1&loop=1&playlist=cZ1HNE4tzwA\" frameborder=\"0\" allowfullscreen></iframe></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I designed an app for birdwatchers, beginners and experts alike. Essentially turning a catalogue book, journal/diary and audio guides in to one comprehensive app. </p><p class=\"\">Get the app and read the reviews here: <a href=\"https://itunes.apple.com/us/app/national-geographic-birds/id315268465?mt=8\" target=\"_blank\">National Geographic Birds: Field Guide to North America</a>. </p><p class=\"\">iPhone and iPad versions in a universal app.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/birds-of-north-america-mdash/image-asset_004.webp\" alt=\"birds-of-north-america image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The pitch.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Together with another UX designer, we created a concept for a pitch NatGeo held and won it. </p><p class=\"\">Since searching for birds is the main activity, we decided to start immediately with the list of birds. From here swiping right brings the menu with other activities and swiping left the filters for the birds. </p><p class=\"\">This animation was part of the pitch that won us the case and not the final app.</p>\n</div>\n<div class=\"project-video\"><iframe src=\"https://www.youtube.com/embed/JR90y0EJqBI?\nautoplay=1&controls=0&showinfo=0&autohide=1&loop=1&playlist=JR90y0EJqBI\" frameborder=\"0\" allowfullscreen></iframe></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The brief.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<ul data-rte-list=\"default\"><li><p class=\"\">Turn a birdwatching field guide with 990 birds in to a meaningful that can be taken with you anywhere you go. </p></li><li><p class=\"\">Figure out what birdwatchers need, both beginners and experts. </p></li><li><p class=\"\">Analyse competition and figure out what is missing and what makes an app better than a book. </p></li><li><p class=\"\">Make ploughing through the pages of the physical copy a breeze with intuitive search tools. </p></li><li><p class=\"\">Utilise the possibilities that mobile computing could bring to birdwatchers. </p></li><li><p class=\"\">Keep in mind that birdwatchers are also holding binoculars, so make the app one-hand use. </p></li></ul>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>My role.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I created about 50% of the concepts, UX and their wireframes and had a really good time doing all this. </p><p class=\"\">I also created the small little microinteractions some the icons have in After Effects to create playfulness and visual feedback of succesful interactions.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Co-creation workshops.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">For this project we held participatory design workshops together with one of the illustrators and authors of the physical book as well as National Geographic's representative. </p><p class=\"\">In these workshops we created first all the ideas related to just finding the correct bird in the list and then the extra activities users might need. A lot of paper prototypes were created after the ideation workshop, so we could keep the functions and navigation models we want and discard those we don't. This helped us to create the functions and navigation in a very short timeframe.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/birds-of-north-america-mdash/image-asset_032.webp\" alt=\"birds-of-north-america image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Wireframes &amp; user flow.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">The app, the whole app and nothing but the app. That's a lot wireframing. Twice a week we changed a bunch them when discussing with the client. Especially the unique feature, digital journal, explained below, demanded a lot of input from National Geographic's bird watching master.</p><p class=\"\">We decided to do this type of combined wireframe/user flow system where wireframes are compiled in to logical blocks that is easy to follow. This was before prototyping existed in any meaningful way.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/birds-of-north-america-mdash/image-asset_031.webp\" alt=\"birds-of-north-america image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Digital journaling.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Bird watchers keep a journal of the birds they have spotted. Each watcher has their way to mark up where and when and how they spotted a bird. </p><p class=\"\">We desired to bring this journal keeping in to the app, mostly for beginning bird watchers, to keep track of their findings. We imagined this as a strategy to get beginner birdwatchers interested in both birdwatching and the app. </p><p class=\"\">Hip youngsters will also share their sightings, so you can Tweet (pun intended) or share via Facebook.  </p>\n</div>\n<div class=\"project-media\"><img src=\"assets/birds-of-north-america-mdash/image-asset.webp\" alt=\"birds-of-north-america image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Most of the time bird watchers go somewhere to spot birds. In the journal we call these \"events\". This way all the birds you have spotted in a location gets recorded in to an event, along with the weather data as well as GPS coordinates and time and date. Automagically!</p>\n</div>\n",
        "images": [
            "assets/birds-of-north-america-mdash/Frame+8.webp",
            "assets/birds-of-north-america-mdash/image-asset.webp",
            "assets/birds-of-north-america-mdash/image-asset_002.webp",
            "assets/birds-of-north-america-mdash/image-asset_003.webp",
            "assets/birds-of-north-america-mdash/image-asset_004.webp",
            "assets/birds-of-north-america-mdash/image-asset_005.webp",
            "assets/birds-of-north-america-mdash/image-asset_006.webp",
            "assets/birds-of-north-america-mdash/image-asset_007.webp",
            "assets/birds-of-north-america-mdash/image-asset_008.webp",
            "assets/birds-of-north-america-mdash/image-asset_009.webp",
            "assets/birds-of-north-america-mdash/image-asset_010.webp",
            "assets/birds-of-north-america-mdash/image-asset_011.webp",
            "assets/birds-of-north-america-mdash/image-asset_012.webp",
            "assets/birds-of-north-america-mdash/image-asset_013.webp",
            "assets/birds-of-north-america-mdash/image-asset_014.webp",
            "assets/birds-of-north-america-mdash/image-asset_015.webp",
            "assets/birds-of-north-america-mdash/image-asset_016.webp",
            "assets/birds-of-north-america-mdash/image-asset_017.webp",
            "assets/birds-of-north-america-mdash/image-asset_018.webp",
            "assets/birds-of-north-america-mdash/image-asset_019.webp",
            "assets/birds-of-north-america-mdash/image-asset_020.webp",
            "assets/birds-of-north-america-mdash/image-asset_021.webp",
            "assets/birds-of-north-america-mdash/image-asset_022.webp",
            "assets/birds-of-north-america-mdash/image-asset_023.webp",
            "assets/birds-of-north-america-mdash/image-asset_024.webp",
            "assets/birds-of-north-america-mdash/image-asset_025.webp",
            "assets/birds-of-north-america-mdash/image-asset_026.webp",
            "assets/birds-of-north-america-mdash/image-asset_027.webp",
            "assets/birds-of-north-america-mdash/image-asset_028.webp",
            "assets/birds-of-north-america-mdash/image-asset_029.webp",
            "assets/birds-of-north-america-mdash/image-asset_030.webp",
            "assets/birds-of-north-america-mdash/image-asset_031.webp",
            "assets/birds-of-north-america-mdash/image-asset_032.webp"
        ],
        "thumbnail": "assets/birds-of-north-america-mdash/Frame+8.webp",
        "original_file": "Birds of North America — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Rolls-Royce",
        "slug": "rolls-royce",
        "description": "Rolls-Royce Website & digital strategy Summary. I have been the lead UX designer for Rolls-Royce’s digital presence for 2 years. During this time I have envisaged their transformation from a car maker with an online catalogue to a digital luxury boutique that boasts articles videos, artworks, accessory shop and the entire dealer network on the site. My role has encompassed: stakeholder interviews, technical studies of the underlying technologies, co-creation workshops with dealers, customer care team members as well as Rolls-Royce’s internal stakeholders. Due to the privacy-minded target audience most user research - bar the initial interviews - has been held in-house and purely testing functionality over appeal. We got high praises from The Drum awards for this work. Read about it here. Help for the customer care team. To ease the the customer care team’s load, we created a system where using privacy-minded cookies we serve different types of visitors, based on the content the have seen on the pages, different methods for contacting the customer care team. Design system. Creation of a design system together with our UI team supports quick iteration and creation of pages and additional experiences. It was now quick to create pages for 150 individual dealers in 46 countries with currently 6 supported languages with plenty more to come. The creation of the accessory boutique and the preparation for an e-commerce store by using the same components and layouts as on the main site saved us months of labour, most of which went in to creating the categories and filters on paper.",
        "short_description": "Rolls-Royce Website & digital strategy Summary. I have been the lead UX designer for Rolls-Royce’s digital presence for 2 years. During this time I have envisaged their transformation from a car...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Rolls-Royce</h1><h2>Website &amp; digital strategy</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I have been the lead UX designer for Rolls-Royce’s digital presence for 2 years.</p><p class=\"\"><br/>During this time I have envisaged their transformation from a car maker with an online catalogue to a digital luxury boutique that boasts articles videos, artworks, accessory shop and the entire dealer network on the site.</p><p class=\"\">My role has encompassed: stakeholder interviews, technical studies of the underlying technologies, co-creation workshops with dealers, customer care team members as well as Rolls-Royce’s internal stakeholders.</p><p class=\"\">Due to the privacy-minded target audience most user research - bar the initial interviews - has been held in-house and purely testing functionality over appeal.</p><p class=\"\"><br/>We got high praises from The Drum awards for this work. <a href=\"http://archive.thedrumdesignawards.com/the-drum-design-awards-2020/9-website-design/rolls-roycemotorcarscom\">Read about it here.</a></p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Help for the customer care team.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">To ease the the customer care team’s load, we created a system where using privacy-minded cookies we serve different types of visitors, based on the content the have seen on the pages, different methods for contacting the customer care team.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1.webp\" alt=\"rolls-royce image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Design system.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Creation of a design system together with our UI team supports quick iteration and creation of pages and additional experiences.</p><p class=\"\"><br/>It was now quick to create pages for 150 individual dealers in 46 countries with currently 6 supported languages with plenty more to come.</p><p class=\"\"><br/>The creation of the accessory boutique and the preparation for an e-commerce store by using the same components and layouts as on the main site saved us months of labour, most of which went in to creating the categories and filters on paper.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/rolls-royce-mdash/Frame+7.webp\" alt=\"rolls-royce image\"></div><div class=\"project-media\"><img src=\"assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_008.webp\" alt=\"rolls-royce image\"></div>",
        "images": [
            "assets/rolls-royce-mdash/Frame+7.webp",
            "assets/rolls-royce-mdash/Frame+7_002.webp",
            "assets/rolls-royce-mdash/Frame+7_003.webp",
            "assets/rolls-royce-mdash/Frame+7_004.webp",
            "assets/rolls-royce-mdash/Frame+7_005.webp",
            "assets/rolls-royce-mdash/Frame+7_006.webp",
            "assets/rolls-royce-mdash/Frame+7_007.webp",
            "assets/rolls-royce-mdash/Frame+7_008.webp",
            "assets/rolls-royce-mdash/Frame+8.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1_002.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1_003.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1_004.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1_005.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1_006.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1_007.webp",
            "assets/rolls-royce-mdash/Screenshot+2021-03-29+at+21.26+1_008.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_002.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_003.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_004.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_005.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_006.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_007.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+All+Accessories+1_008.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%BE%D.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%_002.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%_003.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%_004.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%_005.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%_006.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%_007.webp",
            "assets/rolls-royce-mdash/Screenshot_2021-03-29+Rolls-Royce+Motor+Cars+%D0%9C%D0%_008.webp"
        ],
        "thumbnail": "assets/rolls-royce-mdash/Frame+7.webp",
        "original_file": "Rolls-Royce — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Alicia-T",
        "slug": "alicia-t",
        "description": "Tieto Evry Alicia T - Artificial intelligence CEO Summary. I did the UX and concept designs for an artificial intelligence CEO. This is not science fiction, read more about it here. The actual CEO part is actually here to gather data from thousands of resources simultaneously in real-time and create and alert board members about events and trends that might affect the business. The following screens all are wireframes and not the final product. I worked with Eliana Sarpila banging our heads together to figure this out. This has been one of the most difficult project I have done, due to the uniqueness and sheer strangeness of the product. The problem & the first solution. Since the AI CEO is called Alicia T, it has a personality already with it’s name. Therefore I created a small animation everytime a user accesses the interface (to be viewed on large monitors in meeting rooms) where a female head disintegrates in to dots and group in to topic clusters. Each dot represents a topic that is trending according the sources that Alicia T is crawling through. Essentially, it is listening to chatter on the Internet and creating decisions on which topics in it’s vast database matches that chatter and surfaces those to be visible and tries to connect the dot to other dots in order to make sense what caused the trending of the topic. Board members can pick Alicia’s brain by entering search terms. By typing in mutliple terms the relationships between the dots change and the superclusters morph. Any supercluster can be accessed by tapping it, which opens the detailed view when and what topics created the supercluster. Any dot in the supercluster represents a cluster of topics that created the trend. (Below) Any topic can be hovered over to see in which clusters it belongs to and vice versa. The second version. The second iteration was made to be much simpler and properly support large, ultra-wide screens with a 10-foot interface. The instructions are displayed always and belong to the interface as diegetic UI. Alicia is meant to be used sporadically by people who might not be familiar with how to use it.",
        "short_description": "Tieto Evry Alicia T - Artificial intelligence CEO Summary. I did the UX and concept designs for an artificial intelligence CEO. This is not science fiction, read more about it here. The actual CEO...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Tieto Evry</h1><h2>Alicia T - Artificial intelligence CEO</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">I did the UX and concept designs for an artificial intelligence CEO. This is not science fiction, <a href=\"https://www.theregister.com/2016/10/19/ai_bot_will_guide_finnish_it_firm/\">read more about it here.</a></p><p class=\"\"><br/>The actual CEO part is actually here to gather data from thousands of resources simultaneously in real-time and create and alert board members about events and trends that might affect the business.<br/>The following screens all are wireframes and not the final product. I worked with Eliana Sarpila banging our heads together to figure this out. <br/>This has been one of the most difficult project I have done, due to the uniqueness and sheer strangeness of the product.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The problem &amp; the first solution.</h3>\n</div>\n<div class=\"project-gallery-grid\"><div class=\"gallery-item\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.40.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.41.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.41-1.webp\" alt=\"gallery image\"></div><div class=\"gallery-item\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.42.webp\" alt=\"gallery image\"></div></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Since the AI CEO is called Alicia T, it has a personality already with it’s name. Therefore I created a small animation everytime a user accesses the interface (to be viewed on large monitors in meeting rooms) where a female head disintegrates in to dots and group in to topic clusters.</p><p class=\"\"><br/>Each dot represents a topic that is trending according the sources that Alicia T is crawling through. </p><p class=\"\">Essentially, it is listening to chatter on the Internet and creating decisions on which topics in it’s vast database matches that chatter and surfaces those to be visible and tries to connect the dot to other dots in order to make sense what caused the trending of the topic.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_007.webp\" alt=\"alicia-t image\"></div><div class=\"project-media\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_006.webp\" alt=\"alicia-t image\"></div><div class=\"project-media\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_004.webp\" alt=\"alicia-t image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Board members can pick Alicia’s brain by entering search terms. By typing in mutliple terms the relationships between the dots change and the superclusters morph.<br/>Any supercluster can be accessed by tapping it, which opens the detailed view when and what topics created the supercluster.<br/>Any dot in the supercluster represents a cluster of topics that created the trend. (Below)</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_007.webp\" alt=\"alicia-t image\"></div>\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">Any topic can be hovered over to see in which clusters it belongs to and vice versa.</p>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>The second version.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">The second iteration was made to be much simpler and properly support large, ultra-wide screens with a 10-foot interface. </p><p class=\"\"><br/>The instructions are displayed always and belong to the interface as diegetic UI. Alicia is meant to be used sporadically by people who might not be familiar with how to use it.</p>\n</div>\n<div class=\"project-media\"><img src=\"assets/alicia-t-mdash/tiato_Page_1+1_008.webp\" alt=\"alicia-t image\"></div><div class=\"project-media\"><img src=\"assets/alicia-t-mdash/tiato_Page_2+1_007.webp\" alt=\"alicia-t image\"></div><div class=\"project-media\"><img src=\"assets/alicia-t-mdash/tiato_Page_3+1_007.webp\" alt=\"alicia-t image\"></div><div class=\"project-media\"><img src=\"assets/alicia-t-mdash/tiato_Page_4+1_008.webp\" alt=\"alicia-t image\"></div><div class=\"project-media\"><img src=\"assets/alicia-t-mdash/tiato_Page_6+1_008.webp\" alt=\"alicia-t image\"></div><div class=\"project-media\"><img src=\"assets/alicia-t-mdash/tiato_Page_8+1_006.webp\" alt=\"alicia-t image\"></div>",
        "images": [
            "assets/alicia-t-mdash/Frame+8.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.40.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.41-1.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.41.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.42.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_002.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_003.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_004.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_005.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_006.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_007.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.43_008.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_002.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_003.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_004.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_005.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_006.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_007.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45-1_008.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_002.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_003.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_004.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_005.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_006.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_007.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.45_008.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_002.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_003.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_004.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_005.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_006.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_007.webp",
            "assets/alicia-t-mdash/Screenshot+2021-03-30+at+22.47_008.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1_002.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1_003.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1_004.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1_005.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1_006.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1_007.webp",
            "assets/alicia-t-mdash/tiato_Page_1+1_008.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1_002.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1_003.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1_004.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1_005.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1_006.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1_007.webp",
            "assets/alicia-t-mdash/tiato_Page_2+1_008.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1_002.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1_003.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1_004.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1_005.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1_006.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1_007.webp",
            "assets/alicia-t-mdash/tiato_Page_3+1_008.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1_002.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1_003.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1_004.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1_005.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1_006.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1_007.webp",
            "assets/alicia-t-mdash/tiato_Page_4+1_008.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1_002.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1_003.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1_004.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1_005.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1_006.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1_007.webp",
            "assets/alicia-t-mdash/tiato_Page_6+1_008.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1_002.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1_003.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1_004.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1_005.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1_006.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1_007.webp",
            "assets/alicia-t-mdash/tiato_Page_8+1_008.webp"
        ],
        "thumbnail": "assets/alicia-t-mdash/Frame+8.webp",
        "original_file": "alicia-t — Mikkopi - PORTFOLIO.html"
    },
    {
        "title": "Ø - My own start-up pitch",
        "slug": "startup-pitch",
        "description": "Ø My own start-up pitch Summary. This is me about +30 kilos ago in Slush, the biggest start-up event in Northern Europe, presenting our idea. Unfortunately, this didn’t come in to fruition, but did kick off a relationship between an energy company that sponsored the hackathon where the idea was conceived and the agency I worked for. We were then too soon with our idea for the Finnish market and now it would be too late. The idea came from looking at the accessible information that public charge points produce and reading the news articles about cues at charging stations in Norway.",
        "short_description": "Ø My own start-up pitch Summary. This is me about +30 kilos ago in Slush, the biggest start-up event in Northern Europe, presenting our idea. Unfortunately, this didn’t come in to fruition, but did...",
        "content_html": "\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h1>Ø</h1><h2>My own start-up pitch</h2>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<h3>Summary.</h3>\n</div>\n\n<div class=\"sqs-html-content\" data-sqsp-text-block-content=\"\">\n<p class=\"\">This is me about +30 kilos ago in Slush, the biggest start-up event in Northern Europe, presenting our idea.</p><p class=\"\">Unfortunately, this didn’t come in to fruition, but did kick off a relationship between an energy company that sponsored the hackathon where the idea was conceived and the agency I worked for.</p><p class=\"\">We were then too soon with our idea for the Finnish market and now it would be too late.</p><p class=\"\">The idea came from looking at the accessible information that public charge points produce and reading the news articles about cues at charging stations in Norway.</p>\n</div>\n",
        "images": [
            "assets/oo-pitch-mdash/Frame+8.webp"
        ],
        "thumbnail": "assets/Frame+23.png",
        "original_file": "oo-pitch — Mikkopi - PORTFOLIO.html"
    }
]